[
  {
    "titulacio": "GEI",
    "sigles": "F",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/F",
    "nom": "Física",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "FIS",
    "desc": "L'objectiu principal de l'assignatura és  aprofundir en els temes de Física General que tenen una incidència més gran sobre la Informàtica. Concretament, el programa conté una introducció a l'electromagnetisme, a la teoria de circuits, a les ones electromagnètiques i als fonaments dels circuits digitals. A les pràctiques de laboratori l'estudiant es familiaritza amb la metodologia de la mesura i amb els instruments bàsics  d'un laboratori de hardware."
  },
  {
    "titulacio": "GEI",
    "sigles": "FM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/FM",
    "nom": "Fonaments Matemàtics",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "MAT",
    "desc": "Aquesta assignatura té dues parts. A la primera part, s'exposen els principis de lògica proposicional i de predicats i de raonament matemàtic necessaris pel curriculum. A la segona, s'estudien els conceptes bàsics de l'aritmètica dels enters: divisibilitat i congruències."
  },
  {
    "titulacio": "GEI",
    "sigles": "IC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IC",
    "nom": "Introducció als Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "Sense tenir cap coneixement previ de circuits digitals, els estudiants arriben a comprendre en detall la construcció d'un computador senzill format per un processador RISC que consta d'unes 3.000 portes (NOT, AND i OR) i uns 100 biestables, una memòria principal i un subsistema d'entrada / sortida amb un teclat i una impressora. S'estudien les bases dels circuits digitals combinacionals i seqüencials, es construeixen processadors formats per una unitat de procés i una unitat de control ambdues específiques per a la resolució d'un sol problema i s'arriba al processador de l'ordinador fent generals la unitat de procés i la de control, creant un llenguatge màquina de 25 instruccions que serveix per a executar qualsevol programa que poguéssim escriure en un llenguatge d'alt nivell."
  },
  {
    "titulacio": "GEI",
    "sigles": "PRO1",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PRO1",
    "nom": "Programació I",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q1)",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "CS;ICE",
    "desc": "En l'assignatura s'adquireixen els conceptes i tècniques bàsiques per a la construcció de programes en llenguatges imperatius. En acabar el curs, el/la estudiant:"
  },
  {
    "titulacio": "GEI",
    "sigles": "EC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/EC",
    "nom": "Estructura de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "L'assignatura tracta de l'organització bàsica en què s'estructura un computador per donar suport als llenguatges de programació d'alt nivell, tant pels dels tipus de dades que utilitzen els programes com per les sentències de control més habituals."
  },
  {
    "titulacio": "GEI",
    "sigles": "M1",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/M1",
    "nom": "Matemàtiques I",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q2)",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "MAT",
    "desc": "En aquesta assignatura es continuen desenvolupant el conceptes de raonament introduïts a l'assignatura Fonaments Matemàtics, a la vegada que s'estudien dos temes amb els que tot enginyer informàtic ha d'estar familiaritzat: la teoria de grafs i l'àlgebra lineal."
  },
  {
    "titulacio": "GEI",
    "sigles": "M2",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/M2",
    "nom": "Matemàtiques II",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "MAT",
    "desc": "L'objectiu general de l'assignatura és que, en acabar el curs, els estudiants  d'informàtica estiguin en condicions de conèixer i dominar, des del punt de vista d'usuaris, els conceptes i les tècniques fonamentals del càlcul matemàtic. Més concretament, el curs està orientat a la comprensió i utilització del concepte de funció d'una i de diverses variables."
  },
  {
    "titulacio": "GEI",
    "sigles": "PRO2",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PRO2",
    "nom": "Programació II",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "7.5",
    "Tipus": "Obligatòria",
    "Departament": "CS",
    "desc": "En aquesta assignatura s'introdueix el disseny modular i el disseny basat en objectes, fent servir el llenguatge de programació C++; s'estudien noves estructures de dades lineals (piles, cues, llistes) i arborescents (arbres binaris, n-aris, generals); s'aprofondeix en el disseny iteratiu i recursiu, tant en el raonament sobre la correcció dels dissenys com en la detecció i millora de solucions ineficients; i es presenten implementacions d'estructures de dades lineals i arborescents usant tipus recursius de dades."
  },
  {
    "titulacio": "GEI",
    "sigles": "BD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/BD",
    "nom": "Bases de Dades",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "ESSI",
    "desc": "Aquesta assignatura té com objectiu que l'estudiantat tingui una visió general sobre què és una base de dades, què és un model de base de dades, quins són els seus diferents tipus d'usuaris i llenguatges. En concret s'aprofundeix en el model relacional de bases de bases i en els components lògics que aquest model de bases de dades proveeix, i es practica la creació i l'ús d'aquests components mitjançant el llenguatge SQL. L'assignatura inclou una introducció al disseny de bases de dades relacional, i també l'estudi de temes importants per a l'ús de les bases de dades en el desenvolupament de sistemes software com són els privilegis, les transaccions, i els índexs. Finalment, també es fa una petita introducció als nous sistemes de gestió de bases de dades NOSQL."
  },
  {
    "titulacio": "GEI",
    "sigles": "CI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CI",
    "nom": "Interfícies de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "ESAII",
    "desc": "L'assignatura tracta en profunditat el sistema d'Entrada/Sortida del computador"
  },
  {
    "titulacio": "GEI",
    "sigles": "EDA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/EDA",
    "nom": "Estructures de Dades i Algorismes",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q1)",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "CS",
    "desc": "Aquesta assignatura comença introduint els conceptes d'eficiència i cost d'un algorisme i les eines matemàtiques bàsiques per analitzar-los. A continuació s'utilitzen aquestes bases per estudiar i analitzar el disseny i les diferents implementacions d'algorismes i estructures de dades clàssics i fonamentals."
  },
  {
    "titulacio": "GEI",
    "sigles": "PE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PE",
    "nom": "Probabilitat i Estadística",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q1)",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "EIO",
    "desc": "L'assignatura PE estudia com treballar amb fenòmens aleatoris, com modelar, com quantificar la capacitat predictiva d'un pronòstic i com validar una millora en un producte informàtic. La probabilitat i l'estadística són la base dels mètodes científics, tècnics i de millora de qualitat. Els seus mètodes ofereixen al informàtic la possibilitat de quantificar les garanties dels seus productes davant els seus clients i col·laboradors."
  },
  {
    "titulacio": "GEI",
    "sigles": "SO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SO",
    "nom": "Sistemes Operatius",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q1)",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "La assignatura ofereix una visió del SO des de tres punts de vista: serveis que ofereix el sistema a usuaris/programes i la seva utilització, principals elements de disseny interns de un kernel (estructures de dades i algorismes) , i finalment relaciona aquests dos components per entendre com afecta al rendiment de un sistema la execució dels programes de forma concurrent (o parallela segons la arquitectura). La assignatura es bassa en el context del kernel de un SO (dins del node), no entrant en aspectes de xarxa."
  },
  {
    "titulacio": "GEI",
    "sigles": "AC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/AC",
    "nom": "Arquitectura de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "L'objectiu general és comprendre com funciona un computador actual i els fonaments de disseny i avaluació dels computadors. Es cobreix l'impacte de les decisions de disseny en el rendiment, la potència, el consum energètic, el cost i la fiabilitat. Es tracten temes com ara jerarquia de memòria, memòria virtual, sistemes d'emmagatzematge, joc d'instruccions i tècniques avançades com ara segmentació, processadors superescalars i multiprocessadors. Posant també cert èmfasi en la interacció hardware/software per assolir el rendiment."
  },
  {
    "titulacio": "GEI",
    "sigles": "EEE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/EEE",
    "nom": "Empresa i Entorn Econòmic",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "OE",
    "desc": "PART D'ECONOMIA."
  },
  {
    "titulacio": "GEI",
    "sigles": "IDI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IDI",
    "nom": "Interacció i Disseny d'Interfícies",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "L'assignatura tracta dos temes principals: el disseny d'interfícies i estudi de la seva usabilitat i la interacció gràfica."
  },
  {
    "titulacio": "GEI",
    "sigles": "IES",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IES",
    "nom": "Introducció a l'Enginyeria del Software",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESSI",
    "desc": "L'objectiu principal de l'assignatura és el de proporcionar una visió general de l'enginyeria del software, amb un èmfasi especial a les etapes d'especificació i de disseny. Es pretén que a l'acabar l'assignatura l'alumne sigui capaç d'especificar un sistema senzill mitjançant la notació UML i de dissenyar-lo fent servir la mateixa notació i aplicant el patró arquitectònic domain model i algun dels patrons de disseny més coneguts."
  },
  {
    "titulacio": "GEI",
    "sigles": "XC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/XC",
    "nom": "Xarxes de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Anglès (Q2)",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "L'assignatura de Xarxes de Computadors està dissenyada com a primer curs en aquesta àrea. El seu contingut està centrat fonamentalment en Internet. Durant el curs s'aprèn la complexitat que hi ha al darrera d'aquesta xarxa d'abast mundial, que permet l'intercanvi d'informació de forma fiable i eficient. Per això s'explica com està organitzat Internet, quins són els protocols més importants i per a què serveixen. L'assignatura intenta fer una explicació \"científica\", avaluant amb problemes senzills els protocols que s'expliquen. Una part important de l'assignatura són les sessions de laboratori. En aquestes es realitzen pràctiques acuradament dissenyades per a que s'experimenti \"amb les seves pròpies mans\" els conceptes que s'expliquen en les classes teòriques."
  },
  {
    "titulacio": "GEI",
    "sigles": "PAR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PAR",
    "nom": "Paral·lelisme",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà, Anglès (Q1)",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "AC",
    "desc": "L'assignatura Paral·lelisme cobreix els aspectes fonamentals relacionats amb la programació paral·lela, eina bàsica avui en dia per treure profit de les arquitectures multi-nucli que constitueixen els computadors actuals. Es treballen les principals estratègies de descomposició per tasques i de dades, així com els mecanismes necessaris per assegurar la correctesa (sincronització, exclusió mútua, ...) i formes de millorar el seu rendiment."
  },
  {
    "titulacio": "GEI",
    "sigles": "PROP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PROP",
    "nom": "Projectes de Programació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "CS",
    "desc": "Fer un projecte de programació associat al cicle de vida d'una aplicació informàtica, amb èmfasi en la fase d'implementació."
  },
  {
    "titulacio": "GEI",
    "sigles": "A",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/A",
    "nom": "Algorísmia",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS;BSC;ENTEL",
    "desc": "L'algorísmia estudia els algorismes, les seves propietats i la seva eficiència. L'algorísmia té com a objectiu el desenvolupament de mètodes i tècniques per al disseny d'algorismes i estructures de dades (EDs) eficients i el seu anàlisi, així com el desenvolupament d'algorismes i EDs que resolguin problemes concrets. Després d'un breu repàs de conceptes i tècniques algorísmiques bàsiques ja conegudes, s'estudien noves tècniques de disseny algorísmic com ara el mètode golafre (greedy method), la programació dinàmica, els fluxos sobre xarxes, la programació lineal i l'aleatorització.  Cadascuna de les tècniques de disseny i anàlisi estudiades s'illustra amb exemples concrets, molts dels quals són algorismes i EDs de gran transcedència pràctica com ara l'algorisme de Dijkstra per al càlcul de camins mínims en un graf, l'algorisme de càlcul de la distància d'edició entre dos strings, el test de primalitat de Rabin o l'algorisme de Ford-Fulkerson per trobar el fluxe òptim sobre una xarxa."
  },
  {
    "titulacio": "GEI",
    "sigles": "G",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/G",
    "nom": "Gràfics",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "Un nombre creixent d'aplicacions necessiten representar i visualitzar escenes 3D de forma interactiva en àrees tan diverses com la visualització científica, el disseny gràfic, la realitat virtual,"
  },
  {
    "titulacio": "GEI",
    "sigles": "IA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IA",
    "nom": "Intel·ligència Artificial",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "La intel·ligència artificial és una ciència multi-disciplinar que combina conceptes i mètodes d'àrees molt diverses com la matemàtica, la informàtica, la filosofia, la psicologia i la biologia, entre d'altres. El seu objectiu principal és dotar a un sistema computacional de característiques o comportaments que simulin la intel·ligència. Amb més de 60 anys d'història com a disciplina científica, ha traspassat al mon de la industria per crear sistemes de suport a la presa de decisions, sistemes de diagnosi, mecanismes de control automàtic, robòtica industrial i domèstica, per citar-ne alguns. En l'actualitat, la emergència de les tecnologies web i la disponibilitat de dispositius mòbils cada cop més potents ha impulsat encara més la intel·ligència artificial, convertint-se en un poderós mecanisme per crear sistemes que redueixin la dificultat de trobar i utilitzar informació o aplicacions en xarxa, o fins i tot ser la base per crear noves aplicacions i productes d'èxit. El motor de cerca de Google, el sistema recomanador d'Amazon,  els vehicles de conducció autònoma o la última generació de videojocs que s'adapten a la forma de jugar de l'usuari en son bons exemples.  En aquest curs es vol donar una visió general de la intel·ligència artificial, presentant els tipus de problemes que es poden resoldre, els fonaments teòrics, les tècniques bàsiques i com aplicar-les. L'enfocament de l'assignatura serà un equilibri entre teoria i aplicació pràctica."
  },
  {
    "titulacio": "GEI",
    "sigles": "LI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/LI",
    "nom": "Lògica a la Informàtica",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "La lògica juga un paper bàsic en la informàtica (bases de dades, complexitat computacional, llenguatges de programació, intelligència artificial, disseny i verificació de sistemes hard i soft, etc.), i és sens dubte un dels fonaments que proporcionen la maduresa i agilitat necessàries per assimilar els conceptes, llenguatges, tècniques i eines informàtiques que sorgeixin en el futur. Igual que els arquitectes i enginyers, que analitzen matemàticament les seves construccions, els informàtics necessiten analitzar les propietats lògiques dels seus sistemes mentre els dissenyen, desenvolupen, verifiquen i mantenen, especialment quan es tracta de sistemes crítics"
  },
  {
    "titulacio": "GEI",
    "sigles": "LP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/LP",
    "nom": "Llenguatges de Programació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "Els llenguatges de programació són l'eina bàsica en moltes de les activitats que realitzarà un enginyer informàtic. És per això, que la capacitat de triar el llenguatge de programació més adient és crucial. Cal tenir en compte que no és el mateix si ens interessa principalment l'eficiència, la fiabilitat o la velocitat de desenvolupament. L'assignatura donarà una visió global sobre els llenguatges de programació, així com una petita introducció a la compilació. A més, presentarem amb una mica més de detall els llenguatges funcionals i els usarem per introduir nous elements dels llenguatges de programació, com ara els sistemes de tipus o la programació d'ordre superior. També mostrarem com aquests llenguatges poden ser usats per especificar i modelar hardware i software o, per exemple, en aplicacions financeres. Finalment, es consideraran breument els llenguatges de scripting, cada cop més usats, tant en el prototipat com en el desenvolupament d'aplicacions. Cal remarcar que l'assignatura també treballarà la capacitat per aprendre nous llenguatges."
  },
  {
    "titulacio": "GEI",
    "sigles": "TC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/TC",
    "nom": "Teoria de la Computació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "Des d'un punt de vista pràctic, la teoria de la computació proporciona als alumnes mètodes de descripció i tractament de llenguatges. Depenent del mètode utilitzat, s'obtenen millors o pitjors propietats expressives i computacionals. Aquests mètodes troben aplicacions en àrees com compiladors, gràfics, llenguatges de programació i algorísmia. Però de fet, aquests coneixements són la base per a qualsevol altra àrea de les ciències de la computació, i és habitual trobar-los, per exemple, en articles de recerca de congressos de bases de dades o arquitectura de computadors. A part de les aplicacions, TC és una assignatura de fonament, doncs estudia quins són els límits computacionals de les màquines amb què treballem avui en dia. A més a més, el seu estudi ajuda a desenvolupar habilitats que són de gran ajuda en qualsevol altre àmbit, tals com la capacitat de descriure la informació sense ambigüitats, fer un anàlisi de casos acurat i exhaustiu, o produir una argumentació correcta."
  },
  {
    "titulacio": "GEI",
    "sigles": "AA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/AA",
    "nom": "Ampliació d'Algorísmia",
    "curs_obert": "Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "L'algorísmia és present arreu, més enllà de la informàtica. Per exemple, les nocions bàsiques que utilitzen els biòlegs per expressar similituds entre gens i genomes són definicions algorísmiques. També quan els economistes analitzen la viabilitat de les subhastes combinatòries. Aquestes subhastes es poden interpretar com problemes de cerca combinatòria alguns d'ells intractables computacionalment, problemes que no es poden resoldre eficientment.  La noció de problema computacionalment intractable i en particular de problema NP-complet té un paper fonamental en el disseny d'algorismes. Molts problemes a la pràctica (d'optimització, inteligència artificial, combinatòria, lògica, ... )  són d'aquest tipus. Un cop identificat un problema com a computacionalment difícil hauríem de ser capaços de trobar una solució prou satisfactòria. En aquest curs farem una petita introducció a tècniques que ens permeten tractar problemes difícils:"
  },
  {
    "titulacio": "GEI",
    "sigles": "APA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/APA",
    "nom": "Aprenentatge Automàtic",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "L'objectiu de l'aprenentatge automàtic (machine learning en anglès) és el desenvolupament de teories, tècniques i algorismes que permetin a un sistema modificar el seu comportament a través de la inferència inductiva. Aquesta inferència està basada en l'observació de dades que representen informació incompleta sobre un procés o fenomen estadístic. L'aprenentatge automàtic és un punt de trobada de diferents disciplines: l'estadística, la intel.ligència artificial, la programació i l'optimització, entre d'altres."
  },
  {
    "titulacio": "GEI",
    "sigles": "CAIM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CAIM",
    "nom": "Cerca i Anàlisi d'Informació Massiva",
    "curs_obert": "Q1",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "CS",
    "desc": "La quantitat d'informació emmagatzemada digitalment en moltes organitzacions, o col·lectivament en la web, és avui dia prou gran perquè trobar allò que es busca sigui generalment complicat. El camp conegut com a \"Information Retrieval\" tracta dels mètodes per organitzar informació i permetre després als usuaris trobar-la de manera còmoda i eficient. Cobrirem les tècniques bàsiques de cerca de documentació textual basada en paraules clau. Examinarem després el cas de la cerca en la web, on la presència d'hiperenllaços pot usar-se no sols per dirigir la cerca sinó per valorar l'interès de cada pàgina - és el cas del conegut algorisme PageRank. Veurem l'extensió d'aquestes tècniques al cas de les xarxes socials on el graf d'interaccions entre usuaris proporciona molta informació de què pot interessar a cadascun. Finalment, estudiarem maneres en què aquestes tècniques permeten explotar la informació per a les finalitats d'una organització en concret."
  },
  {
    "titulacio": "GEI",
    "sigles": "CL",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CL",
    "nom": "Compiladors",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "CS",
    "desc": "La interacció persona-màquina sovint es realitza mitjançant llenguatges de programació i darrera de cada llenguatge hi ha eines de traducció i/o interpretació que permeten executar els programes. Els exemples d'eines més coneguts són els compiladors i intèrprets. En aquesta assignatura ens endinsarem dins de l'estructura d'aquestes eines per conèixer com fan l'anàlisi del llenguatge, la seva traducció a instruccions de la màquina i l'optimització d'aquestes instruccions."
  },
  {
    "titulacio": "GEI",
    "sigles": "CN",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CN",
    "nom": "Computació Numèrica",
    "curs_obert": "Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "MAT",
    "desc": "Aquesta assignatura ofereix una visió àmplia de l'anàlisi numèrica per a què els estudiants adquireixin un bon domini dels temes de fonament de l'àrea i alhora es familiaritzin amb els conceptes, mètodes bàsics, tècniques actuals, aplicacions per a ordinadors personals i llibreries modernes utilitzades a la pràctica. La primera i la segona part de l'assignatura introdueixen el material més bàsic i fonamental, mentre que la tercera part posa més èmfasi a resoldre tipus d'equacions que tots els enginyers han d'entendre i ser capaços d'aplicar: equacions en derivades. L'assignatura s'enfoca a obrir l'amplada de mires dels estudiants per incloure tants mètodes i aplicacions com sigui possible i per a què en surtin amb un bagatge sòlid com a programadors i usuaris dels mètodes numèrics."
  },
  {
    "titulacio": "GEI",
    "sigles": "IO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IO",
    "nom": "Investigació Operativa",
    "curs_obert": "Q1",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "EIO",
    "desc": "En l'entorn d'organitzacions complexes d'abast mitjà  i gran en la indústria, l'administració i els negocis, els resultats de la presa de decisions que poden incidir en el seu funcionament/rendiment és de la màxima importància per als seus responsables. La Investigació Operativa és una disciplina orientada a proporcionar eines d'elaboració, d'anàlisi i de resolució eficient de models d'aquests sistemes mitjançant les quals es pot mesurar quantitativament els resultats de les decisions de la direcció de les organitzacions. Avui en dia resulta clau la integració d'aquesta classe de sistemes d'ajut a la presa de decisions dins dels diferents sistemes de informació que poden operar en les organitzacions. El curs s'inicia presentant un cas d'estudi amb el que il·lustrar aquests conceptes i continua amb l'exposició de models assentats en la Investigació Operativa i les seves tècniques de resolució eficient. Al llarg del curs els estudiants desenvoluparan i resoldran un d'aquests models adaptat a les necessitats del cas real d'una organització i s'avaluarà  i discutirà  la seva interacció amb els sistemes d'informació presents en ella."
  },
  {
    "titulacio": "GEI",
    "sigles": "SID",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SID",
    "nom": "Sistemes Intel·ligents Distribuïts",
    "curs_obert": "Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "Hi ha dos objectius en aquest curs: en primer lloc, proveïr els estudiants dels coneixements matemàtics i computacionals suficients per analitzar sistemes distribuïts intel·ligents mitjançant models adequats, i en segon lloc, il·lustrar diverses estratègies de coordinació i mostrar com implementar-les i optimitzar-les. El curs s'estructura en una combinació de classes teòriques i exercicis de laboratori fent servir plataformes reals de hardware i de simulació. Es tracten els següents temes: 1) introducció als concepts claus com per exemple el concepte d'auto-organització i a les eines de software i hardware utilitzats durant el curs, 2) exemples de sistemes intelligents distribuïts naturals, artificials i híbrids, 3) conceptes d'aprenentatge automàtic: tècniques mono- i multi-agents, i 4) estratègies de coordinació i control distribuït."
  },
  {
    "titulacio": "GEI",
    "sigles": "AC2",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/AC2",
    "nom": "Arquitectura de Computadors II",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "AC-2 descriu la implementació interna del processador a nivell d'arquitectura. Presenta la implementació basada en segmentació i després hi introdueix millores de rendiment com els curtcircuits i els mecanismes de reordenament de les instruccions."
  },
  {
    "titulacio": "GEI",
    "sigles": "DSBM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/DSBM",
    "nom": "Disseny de Sistemes Basats en Microcomputadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESAII",
    "desc": "L'objectiu principal de l'assignatura és adquirir els coneixements necessaris per tal de dissenyar i implementar sistemes encastats tant en la seva vessant maquinari (disseny d'interfícies d'entrada/sortida, disseny de sistemes de supervisió de microcontroladors, connexió de perifèrics avançats, disseny de maquinari amb immunitat al soroll ...) com programari (programació amb recursos escassos, programació conscient del maquinari, temps real a partir d'interrupcions, concurrència de tasques de temps real, comunicacions amb perifèrics avançats ...)"
  },
  {
    "titulacio": "GEI",
    "sigles": "MP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/MP",
    "nom": "Multiprocessadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "L'objectiu principal d'aquesta assignatura és que l'alumne adquireixi els fonaments de consistència de memòria i coherència de cache en sistemes multiprocessador. El contingut de l'assignatura cobreix l'espectre de multiprocessadors de petita escala fins a mutliprocessadors escalables. També se centra en la disponibilitat i la utilització d'instruccions atòmiques de lectura-modificació-escriptura. En concret, els temes desenvolupats capaciten per a l'avaluació del rendiment d'un sistema multiprocessador en executar aplicacions paral·leles. A més, capaciten per a la utilització de llenguatges de descripció maquinari i la seva utilització per a l'especificació de la jerarquia de memòria en un multiprocessador."
  },
  {
    "titulacio": "GEI",
    "sigles": "PEC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PEC",
    "nom": "Projecte d'Enginyeria de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Computadors)",
    "Departament": "DAC;ESAII",
    "desc": "Aquesta assignatura és impartida pel departament d'ESAII i el departament d'AC en quadrimestres alterns. El projecte a realitzar (i les seves tasques associades) és una mica diferent en funció del quadrimestre."
  },
  {
    "titulacio": "GEI",
    "sigles": "SO2",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SO2",
    "nom": "Sistemes Operatius II",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "Aquesta assignatura ofereix una visió interna del funcionament bàsic d'un Sistema Operatiu, mitjançant la implementació de diferents components del sistema, i diferents mètriques per a l'avaluació del seu rendiment."
  },
  {
    "titulacio": "GEI",
    "sigles": "XC2",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/XC2",
    "nom": "Xarxes de Computadors II",
    "curs_obert": "Q1, Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "Aquesta assignatura explica detalladament l'arquitectura i els protocols d'Internet, sobretot centrant-se en la combinació hardware / software que permet tenir avui dia xarxes programables per a una comunicació flexible, fiable i dinàmica."
  },
  {
    "titulacio": "GEI",
    "sigles": "CASO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CASO",
    "nom": "Conceptes Avançats de Sistemes Operatius",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "En l'assignatura de Conceptes Avançats de Sistemes Operatius (CASO), l'estudiant aprendrà  a dissenyar, implementar i analitzar sistemes operatius, l'entorn d'execució que ofereixen i avaluar la seva qualitat. Els continguts de l'assignatura cobreixen els temes d'arquitectures on s'executa un sistema operatiu, des d'entorns mòbils fins a servidors, suport hardware necessari per l'SO, tipus de serveis que ofereixen els sistemes operatius, requeriments de les aplicacions i temps real, control de l'energia, suport al paral·lelisme, desenvolupament d'aplicacions sobre l'SO, tècniques de virtualització i gestió de la garantia i seguretat del sistema i les aplicacions. L'avaluació de l'assignatura es farà mitjançant tres controls parcials al llarg del quadrimestre, un examen de laboratori i un examen final."
  },
  {
    "titulacio": "GEI",
    "sigles": "CPD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CPD",
    "nom": "Centres de Processament de Dades",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "AC",
    "desc": "L'assignatura està pensada perquè els estudiants entenguin la complexitat de funcionament d'un gran centre de processament de dades, coneguin els seus elements i les idees bàsiques de disseny y operació dels mateixos."
  },
  {
    "titulacio": "GEI",
    "sigles": "PAP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PAP",
    "nom": "Programació i Arquitectures Paral·leles",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "En aquesta assignatura s'aprofundeix en els temes de paral·lelisme estudiats a l'assignatura PAR. En concret es treballen tres aspectes: 1) implementació d'un model de programació de memòria compartida tipus OpenMP, fent ús dels mecanismes oferts per una llibreria de threads de baix nivell (Pthreads) i la generació de codi per part d'un compilador (gcc); 2) disseny d'un clúster de memòria distribuïda a partir dels components bàsics: nodes multiprocessador/multicore, acceleradors, interfícies de xarxa i altres components per crear la xarxa d'interconnexió; i 3) estudiar un model de programació per arquitectures clúster (MPI)."
  },
  {
    "titulacio": "GEI",
    "sigles": "PCA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PCA",
    "nom": "Programació Conscient de l'Arquitectura",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "Assignatura molt pràctica que té com objectiu principal l'aprenentatge de técniques de programació per \"l'optimització\" (reducció del temps d'execució) d'aplicacions; considerant l'arquitectura del computador i el que pot fer el compilador,  utilitzant eines de mesura i anàlisi i eines d'alt nivell de desenvolupament de hardware específic des de codi C."
  },
  {
    "titulacio": "GEI",
    "sigles": "PDS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PDS",
    "nom": "Processament Digital del Senyal",
    "curs_obert": "Q1",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "ESAII",
    "desc": "L'assignatura Processament Digital del Senyal forma a l'estudiant en les tècniques i eines fonamentals del processament digital del senyal, i en el maquinari necessari per a la implementació d'aquests sistemes. Un processador digital de senyals o DSP és un sistema basat en un processador o microprocessador que posseeix un joc d'instruccions, un maquinari i un programari optimitzats per a aplicacions que requereixin operacions numèriques a molt alta velocitat."
  },
  {
    "titulacio": "GEI",
    "sigles": "STR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/STR",
    "nom": "Sistemes de Temps Real",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "ESAII",
    "desc": "Un sistema es diu de temps real quan interactua amb el món real (procés físic) dintre d'uns requeriments temporals. En un Sistema de Temps Real (STR) la resposta no només ha de ser correcta sino que ha d'arribar en el temps adequat o es considera que el sistema ha fallat. És el cas de l'activació de l'airbag o de l'ABS en un cotxe per posar dos exemples crítics, però també el d'un robot que ha d'agafar una pilota al vol. En acabar l'assignatura l'alumne entendrà la diferencia entre un sistema ràpid i un de temps real, així com la distinció entre un sistema de temps real dur, tou o crític. Sabrà analitzar, dissenyar i implementar sistemes basats en microcomputadors amb requeriments de criticitat temporal, fiabilitat i cost."
  },
  {
    "titulacio": "GEI",
    "sigles": "VLSI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/VLSI",
    "nom": "VLSI",
    "curs_obert": "Q1",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "En l'assignatura de VLSI, l'alumne aprendrà el procés de disseny i fabricació dels microprocessadors com a exemple de circuit integrat. Els continguts de l'assignatura cobreixen les àrees de disseny VLSI i de circuits integrats. En concret, els temes tractats seran el de tecnologia CMOS, disseny de circuits (seqüencials i combinacionals), avaluació del retard i consum dels dissenys, metodologia i fases del disseny i impacte de la tecnologia en el disseny. L'avaluació de l'assignatura es farà mitjançant dos exàmens durant el curs (o opcionalment un final) i l'elaboració de les pràctiques del curs."
  },
  {
    "titulacio": "GEI",
    "sigles": "AS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/AS",
    "nom": "Arquitectura del Software",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "L'objectiu de l'assignatura és capacitar a l'estudiantat per dissenyar i implementar sistemes software mitjançant l'aplicació d'un conjunt de tècniques, principis i patrons de disseny."
  },
  {
    "titulacio": "GEI",
    "sigles": "ASW",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ASW",
    "nom": "Aplicacions i Serveis Web",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "En aquesta assignatura volem que l'alumne adquireixi d'un coneixement profund, crític i sistemàtic de les tecnologies més importants per al desenvolupament d'aplicacions i serveis web moderns, que sàpiga com utilitzar-les en situacions concretes i que ho faci d'acord amb els principis de disseny i les bones pràctiques més apropiats en cada cas."
  },
  {
    "titulacio": "GEI",
    "sigles": "DBD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/DBD",
    "nom": "Disseny de Bases de Dades",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "Aquesta assignatura forma els estudiants en les competències necessàries per a dissenyar i administrar bases de dades, avaluant les diferents alternatives possibles en el context de la seva empresa. S'hi tracten conceptes de bases de dades relacionals genèriques (aplicables tant a entorns operacionals com decisionals). Els coneixements impartits són imprescindibles per afrontar les tasques pròpies d'un dissenyador de bases de dades o d'un administrador de bases de dades."
  },
  {
    "titulacio": "GEI",
    "sigles": "ER",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ER",
    "nom": "Enginyeria de Requisits",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "La tasca més difícil de la construcció d'un sistema d'informació o, en general, d'un sistema software, consisteix en determinar quin sistema s'ha de construir. Aquesta tasca s'anomena Enginyeria de Requisits. No hi ha cap altra tasca que tingui un impacte econòmic i social tan negatiu si es fa malament. Molts dels fracassos en el desenvolupament de sistemes s'atribueixen a no fer bé la seva enginyeria de requisits. En aquesta assignatura es presenten els conceptes, les activitats i els artefactes de l'enginyeria de requisits. S'insisteix en els aspectes que són essencials per garantir l'èxit dels projectes, principalment la definició dels objectius de les parts interessades, la formulació correcta dels requisits, i l'argumentació de satisfacció. El mètode docent de l'assignatura és de la família del PBL (Project Based Learning) i l'element central és un projecte (que varia cada curs) per al qual els estudiants, treballant en grup, n'han de fer l'enginyeria de requisits completa."
  },
  {
    "titulacio": "GEI",
    "sigles": "GPS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/GPS",
    "nom": "Gestió de Projectes de Software",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "L'objectiu de l'assignatura és capacitar a l'estudiantat per a gestionar projectes de software tant en el context de processos de gestió clàssica com en el de processos de gestió àgil."
  },
  {
    "titulacio": "GEI",
    "sigles": "PES",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PES",
    "nom": "Projecte d'Enginyeria del Software",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "El Projecte es l'activitat mes habitual de la enginyeria en el seu desenvolupament professional, fins i tot en moltes empreses tota la feina d'enginyeria s'organitza al voltant dels projectes. I l'enginyeria informàtica no està al marge d'aquesta tendència, ben al contrari, hi és ben present. Dins l'especialitat d'enginyeria del software, aquesta assignatura està pensada per reproduir, en la mesura del possible, l'activitat de desenvolupament de projectes de sistemes software tal com succeeix a l'entorn professional, es a dir, al voltant d'un equip de projecte amb rols diferenciats, i tenint en compte tots els aspectes de la gestió d'un projecte: planificació, costos, terminis, entregables, actes de reunions, presentacions orals, etc...Es tracta doncs d'una assignatura completament pràctica. Les tècniques necessàries ja han estat adquirides en assignatures prèvies (GPS, ER, AS i precedents), i a PES les posaran en pràctica en la realització d'un projecte sobre un cas que es presentarà."
  },
  {
    "titulacio": "GEI",
    "sigles": "CAP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CAP",
    "nom": "Conceptes Avançats de Programació",
    "curs_obert": "Q1",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "CS",
    "desc": "Aquesta assignatura pretén explicar conceptes de programació que aprofundeixen en l'ús de determinades construccions i estructures lligades a paradigmes de programació que els estudiants ja haurien de conèixer. Enguany s'explica programació funcional: funcions com a objectes de primera classe, closures i model d'entorns, programació fent servir funcions d'ordre superior (composició, pipelining, tail call optimization, continuation passing style, etc), immutabilitat en estructures de dades, avaluació mandrosa i macros."
  },
  {
    "titulacio": "GEI",
    "sigles": "CBDE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CBDE",
    "nom": "Conceptes per a Bases de Dades Especialitzades",
    "curs_obert": "Q1",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "Abans del nou mil·lenni, les bases de dades relacionals (BDRs) simbolitzaven el paradigma \"one size fits all\" per a l'emmagatzemament de dades. És a dir, eren la solució universal per a emmagatzemar, processar i accedir dades en qualsevol escenari, fos quin fos. Això, però, ha canviat amb l'arribada de nous reptes (molts d'ells impensables 20 anys enrere) que han portat els gestors relacionals al límit de la seva capacitat."
  },
  {
    "titulacio": "GEI",
    "sigles": "CSI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CSI",
    "nom": "Conceptes de Sistemes d'Informació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "ESSI",
    "desc": "L'assignatura \"Conceptes de Sistemes d'Informació\" (CSI) vol situar-se a la intersecció entre organització i informàtica, on es presenta la funció dels sistemes d'informació a les organitzacions. Tot parteix de la introducció detallada del concepte de sistema d'informació, i la seva aplicació pel suport del funcionament de les organitzacions humanes."
  },
  {
    "titulacio": "GEI",
    "sigles": "ECSDI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ECSDI",
    "nom": "Enginyeria del Coneixement i Sistemes Distribuïts Intel·ligents",
    "curs_obert": "Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "CS",
    "desc": "L'objectiu d'aquesta assignatura és donar a l'alumne els coneixements bàsics sobre les últimes tendències en l'ús de tècniques d'Intelligència Artificial en sistemes distribuïts de forma que pugui entendre-les i emprar-les en la seva pràctica professional. Es preveu que el contingut de l'assignatura es vagui actualitzant contínuament per incorporar les noves tendències que vaguin sorgint."
  },
  {
    "titulacio": "GEI",
    "sigles": "SIM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SIM",
    "nom": "Simulació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "EIO",
    "desc": "La simulació es una disciplina que permet representar, modelar i entendre el comportament de sistemes complexos i predir el seu comportament futur. Aquesta assignatura proporciona a l'alumne el coneixement i les eines necessàries per a la construcció de models complexos de simulació, la utilització de llenguatges estàndard, l'anàlisi de les dades d'entrada, el disseny d'experiments i l'anàlisi de resultats en simulació.  També es tracten en el curs temes sobre visualització,  aplicacions a casos reals i els aspectes relacionats amb el rendiment."
  },
  {
    "titulacio": "GEI",
    "sigles": "SOAD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SOAD",
    "nom": "Sistemes Operatius per a Aplicacions Distribuïdes",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria del Software)",
    "Departament": "AC",
    "desc": "Aquesta assignatura és una intensificació dels conceptes bàsics de SO. NO ES UNA ASSIGNATURA SOBRE SO DISTRIBUITS. El seu objectiu és entendre millor com la gestió de recursos per part del SO pot afectar al rendiment i eficiència d'aplicacions distribuïdes, com ara BBDD, cercadors, etc. S'estendran les polítiques i estratègies de gestió de recursos a altres nivells, com runtimes, middlewares o llibreries."
  },
  {
    "titulacio": "GEI",
    "sigles": "ADEI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ADEI",
    "nom": "Anàlisi de Dades i Explotació de la Informació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "EIO",
    "desc": "L'objectiu de ADEI es la de dotar als estudiants dels coneixements i habilitats per poder fer front a les necessitats d'informació de les organitzacions, això és, saber aprofitar les dades emmagatzemades pels SI de les organitzacions per tal d'integrar sistemes automà tics d'ajuda a la presa de decisions. La idea subjacent és que les dades són un tresor per a les organitzacions i que mitjançant la seva explotació es fa palesa la informació que contenen."
  },
  {
    "titulacio": "GEI",
    "sigles": "DSI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/DSI",
    "nom": "Disseny de Sistemes d'Informació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "L'assignatura de Disseny de Sistemes d'Informació (DSI) està  organitzada per a assolir tres objectius. Per una banda, estudiar diferents estratègies actuals per tal de proveir a les organitzacions d'un Sistema d'Informació: desenvolupament a mida, outsourcing i offshoring, adopció de grans paquets de software estàndard, integració d'aplicacions, etc. Per altra banda, es fa una anàlisi detallada de l'arquitectura en capes dels Sistemes d'Informació i s'estudien les principals decisions a prendre per a realitzar el disseny de cada una de les capes. Finalment, l'assignatura està  basada en assolir la competència d'aprenentatge autònom mitjançant l'estudi i pràctica dels conceptes relacionats amb la temàtica de forma individual per part de l'estudiant i amb debats i discussions a classe."
  },
  {
    "titulacio": "GEI",
    "sigles": "ER",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ER",
    "nom": "Enginyeria de Requisits",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "La tasca més difícil de la construcció d'un sistema d'informació o, en general, d'un sistema software, consisteix en determinar quin sistema s'ha de construir. Aquesta tasca s'anomena Enginyeria de Requisits. No hi ha cap altra tasca que tingui un impacte econòmic i social tan negatiu si es fa malament. Molts dels fracassos en el desenvolupament de sistemes s'atribueixen a no fer bé la seva enginyeria de requisits. En aquesta assignatura es presenten els conceptes, les activitats i els artefactes de l'enginyeria de requisits. S'insisteix en els aspectes que són essencials per garantir l'èxit dels projectes, principalment la definició dels objectius de les parts interessades, la formulació correcta dels requisits, i l'argumentació de satisfacció. El mètode docent de l'assignatura és de la família del PBL (Project Based Learning) i l'element central és un projecte (que varia cada curs) per al qual els estudiants, treballant en grup, n'han de fer l'enginyeria de requisits completa."
  },
  {
    "titulacio": "GEI",
    "sigles": "NE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/NE",
    "nom": "Negoci Electrònic",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "OE",
    "desc": "Les aplicacions informàtiques i les tecnologies de la informació són bàsiques pel funcionament de les empreses o les institucions. Més enllà de les aplicacions que les empreses utilitzen per donar suport a les seves activitats en clau interna (ERP), cada cop són més importants les aplicacions que, sovint a través d'Internet, permeten a les empreses connectar amb els sistemes informàtics dels seus clients, proveïdors o qualsevol altra empresa col·laboradora. També és cada cop més important el comerç electrònic, es a dir, el desenvolupament de sistemes que permetin la venda a traves d'Internet. De tot això s'ocupa aquesta assignatura. Per una banda es tracta el tema del comerç electrònic d'una manera molt pràctica, ja que l'estudiantat haurà de dissenyar i crear un comerç electrònic per una empresa imaginaria que ell mateix triï. La creació del comerç es farà amb un sistema \"open source\" que facilita la creació de tendes electròniques: definició de productes, cistella de la compra, pagaments, marquèting, gestió de preus, plantilla visual de la tenda, etc. D'altra banda, es tractaran en profunditat els sistemes de gestió de les relacions amb els clients (sistemes CRM) i els sistemes de gestió de la cadena d'aprovisionament (sistemes SCM), entre d'altres. Aquesta part amplia el concepte de sistemes d'informació explicat a SIO, cobrint aquelles activitats que tenen a veure amb els clients i els proveïdors, sistemes que aprofiten Internet i que incideixen directament en com les empreses organitzen les seves funcions de negoci. Aquesta part també té un enfocament pràctic en base a la resolució i presentació de casos."
  },
  {
    "titulacio": "GEI",
    "sigles": "PSI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PSI",
    "nom": "Projecte de Sistemes d'Informació",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "L'especialista en Sistemes d'Informació és un professional que realitza la seva activitat professional entre dos mons, l'empresa i la informàtica. Concretament, es preocupa per assegurar l'alineament entre les solucions informàtiques implantades a les organitzacions, i els objectius i estratègia de negoci d'aquestes organitzacions. Dins de l'especialitat, aquesta assignatura està pensada per reproduir, en la mesura del possible, l'activitat de definició d'un Pla de Sistemes d'Informació.  A partir de l'estudi d'un cas (descripció d'una empresa), els alumnes han de poder definir un Pla de Sistemes d'Informació, és a dir, un conjunt de projectes d'informatització prioritzats per tal de recolzar l'estratègia de negoci de l'empresa amb l'ús de Sistemes d'Informació. Es tracta doncs d'una assignatura completament pràctica. Els coneixements i tècniques necessàries ja han estat adquirides en assignatures prèvies de l'especialitat o precedents, i a PSI les posaran en pràctica en la definició d'un Pla de Sistemes d'Informació pel cas que es considera. Començarem amb l'anàlisi de la situació actual de l'empresa, tant pel que fa referència als processos de negoci com pels Sistemes d'Informació de l'empresa, per a generar un conjunt de idees de projectes d'informatització alineats amb l'estratègia i objectius de l'empresa. Posteriorment, es definiran, prioritzaran i planificaran un conjunt de projectes de desenvolupament i/o implantació de Sistemes d'Informació."
  },
  {
    "titulacio": "GEI",
    "sigles": "SIO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SIO",
    "nom": "Sistemes d'Informació per a Les Organitzacions",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "L'assignatura \"Sistemes d'Informació per a les Organitzacions\" (SIO) vol situar-se a la intersecció entre organització i informàtica, on es presenta la funció dels sistemes d'informació a les organitzacions. Tot parteix de la introducció detallada del concepte de sistema d'informació, i la seva aplicació pel suport del funcionament de les organitzacions humanes."
  },
  {
    "titulacio": "GEI",
    "sigles": "ABD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ABD",
    "nom": "Administració de Bases de Dades",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "ESSI",
    "desc": "L'Administrador de la Base de Dades (ABD) és un professional que no només té un alts coneixements tècnics de disseny i manteniment de bases de dades, sinó que a més aporta valor de negoci al sistema d'informació. És l'encarregat del disseny conceptual i físic, de la seguretat i autoritzacions, de la disponibilitat i recuperació de les dades i del rendiment adequat de la base de dades. En aquesta assignatura es pretén no només formar tècnicament futurs administrador de bases de dades sinó també fer entendre la importància d'aquesta figura per a la continuïtat de negoci de les organitzacions, com a responsable de l'eficient i completa disponibilitat de les dades."
  },
  {
    "titulacio": "GEI",
    "sigles": "CAIM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CAIM",
    "nom": "Cerca i Anàlisi d'Informació Massiva",
    "curs_obert": "Q1",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "CS",
    "desc": "La quantitat d'informació emmagatzemada digitalment en moltes organitzacions, o col·lectivament en la web, és avui dia prou gran perquè trobar allò que es busca sigui generalment complicat. El camp conegut com a \"Information Retrieval\" tracta dels mètodes per organitzar informació i permetre després als usuaris trobar-la de manera còmoda i eficient. Cobrirem les tècniques bàsiques de cerca de documentació textual basada en paraules clau. Examinarem després el cas de la cerca en la web, on la presència d'hiperenllaços pot usar-se no sols per dirigir la cerca sinó per valorar l'interès de cada pàgina - és el cas del conegut algorisme PageRank. Veurem l'extensió d'aquestes tècniques al cas de les xarxes socials on el graf d'interaccions entre usuaris proporciona molta informació de què pot interessar a cadascun. Finalment, estudiarem maneres en què aquestes tècniques permeten explotar la informació per a les finalitats d'una organització en concret."
  },
  {
    "titulacio": "GEI",
    "sigles": "EDO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/EDO",
    "nom": "Estratègia Digital a Les Organitzacions",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "OE",
    "desc": "Les organitzacions han de desenvolupar una estratègia digital que doni suport a la seva estratègia i a l'assoliment dels objectius fixats en aquesta. Partint de cóm es defineix la estratègia a una empresa i donat el gran ventall de solucions basades en Tecnologies de la Informació (TI) existents al mercat, cal comprendre com amb les TI podem contribuir a l'estratègia digital a cada àrea o departament: comercial i màrqueting, finances, logística i distribució, compres, producció i recursos humans. Per cadascun d'aquestes àrees:"
  },
  {
    "titulacio": "GEI",
    "sigles": "IO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IO",
    "nom": "Investigació Operativa",
    "curs_obert": "Q1",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació)",
    "Departament": "EIO",
    "desc": "En l'entorn d'organitzacions complexes d'abast mitjà  i gran en la indústria, l'administració i els negocis, els resultats de la presa de decisions que poden incidir en el seu funcionament/rendiment és de la màxima importància per als seus responsables. La Investigació Operativa és una disciplina orientada a proporcionar eines d'elaboració, d'anàlisi i de resolució eficient de models d'aquests sistemes mitjançant les quals es pot mesurar quantitativament els resultats de les decisions de la direcció de les organitzacions. Avui en dia resulta clau la integració d'aquesta classe de sistemes d'ajut a la presa de decisions dins dels diferents sistemes de informació que poden operar en les organitzacions. El curs s'inicia presentant un cas d'estudi amb el que il·lustrar aquests conceptes i continua amb l'exposició de models assentats en la Investigació Operativa i les seves tècniques de resolució eficient. Al llarg del curs els estudiants desenvoluparan i resoldran un d'aquests models adaptat a les necessitats del cas real d'una organització i s'avaluarà  i discutirà  la seva interacció amb els sistemes d'informació presents en ella."
  },
  {
    "titulacio": "GEI",
    "sigles": "MI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/MI",
    "nom": "Màrqueting a Internet",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "OE",
    "desc": "Internet s'ha convertit no solament en un mitjà de comunicació emergent sinó predominant, especialment per les generacions més joves, superant fins i tot la televisió.  Un 30% de la població mundial, més de 2.000 milions de persones, son usuaris d'Internet (març 2011). En els últims anys s'ha accentuat un canvi de paradigma anomenat web 2.0 en el que les persones no són merament receptores d'informació sinó partícips, creant, compartint i reutilitzant els continguts de la web. Paral·lelament els serveis s'han enriquit i diversificat, al correu electrònic i les pàgines web estàtiques s'han afegit nous serveis en constant evolució: multitud d'aplicacions web dinàmiques i interactives, xats, fòrums, missatgeria instantània, videoconferència, xarxes socials, videostreaming, y un llarg etc. Sense oblidar l'arribada de les plataformes mòbils com telèfons intel·ligents, tabletes, etc."
  },
  {
    "titulacio": "GEI",
    "sigles": "VPE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/VPE",
    "nom": "Viabilitat de Projectes Empresarials",
    "curs_obert": "Q1",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Sistemes d'informació)",
    "Departament": "OE",
    "desc": "Els titulats universitaris es poden trobar davant la situació d'analitzar o emprendre un projecte de desenvolupament d'un negoci propi. Això es especialment cert en el cas dels enginyers/eres informàtics."
  },
  {
    "titulacio": "GEI",
    "sigles": "ASO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ASO",
    "nom": "Administració de Sistemes Operatius",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "Aquesta assignatura té per objectiu introduir a l'estudiant els conceptes bàsics d'administració de sistemes operatius. Es tracten entre d'altres temes com la gestió d'usuaris, el monitoratge dels recursos, així com l'administració de màquines virtuals en entorns corporatius."
  },
  {
    "titulacio": "GEI",
    "sigles": "PI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PI",
    "nom": "Protocols d'Internet",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "L'assignatura de Protocols d'Internet tracta com és l'arquitectura d'Internet, de com es dissenya un proveïdor de serveis d'Internet (ISP), de com es dissenya un centre de processament de dades (CPD), i de com es dissenya el departament de tecnologies de la informació (IT) d'una empresa."
  },
  {
    "titulacio": "GEI",
    "sigles": "PTI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PTI",
    "nom": "Projecte de Tecnologies de la Informació",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "L'assignatura està centrada en el desenvolupament d'un projecte de tecnologies de la informació. En la primera fase s'elabora la proposta de projecte i es realitzen pràctiques dirigides. En la segona fase es desenvolupa el projecte en grup,  per presentar resultats i conclusions a tota la classe al final de curs."
  },
  {
    "titulacio": "GEI",
    "sigles": "SI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SI",
    "nom": "Seguretat Informàtica",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "Introducció als conceptes bàsics de seguretat informàtica que tots els graduats haurien de conèixer per poder fer la seva feina sense posar en perill els sistemes informàtics que gestionen o programen, o els seus usuaris."
  },
  {
    "titulacio": "GEI",
    "sigles": "SOA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SOA",
    "nom": "Sistemes Operatius Avançats",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "Aquesta assignatura ofereix una visió interna del funcionament bàsic d'un Sistema Operatiu, avaluant la implicació que té sobre el rendiment de les aplicacions la implementació de diferents components de sistema."
  },
  {
    "titulacio": "GEI",
    "sigles": "TXC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/TXC",
    "nom": "Tecnologies de Xarxes de Computadors",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "L'assignatura Tecnologia de Xarxes de Computadors (TXC) proporciona els coneixements i competències necessàries per entendre el disseny de solucions de connectivitat entre ordinadors i dispositius informàtics més enllà de l'entorn local. La base de l'assignatura és l'estudi de les arquitectures, els protocols de comunicació i els fonaments de les  tecnologies de transmissió de dades en les que se suporten les xarxes de computadors d'àrea ampla, i en particular Internet."
  },
  {
    "titulacio": "GEI",
    "sigles": "AD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/AD",
    "nom": "Aplicacions Distribuïdes",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "Assignatura on és treballa amb protocols del nivell d'aplicació de les xarxes de computadors i aplicacions distribuïdes, incloent aplicacions per a dispositius mòbils."
  },
  {
    "titulacio": "GEI",
    "sigles": "CASO",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CASO",
    "nom": "Conceptes Avançats de Sistemes Operatius",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Computadors)",
    "Departament": "AC",
    "desc": "En l'assignatura de Conceptes Avançats de Sistemes Operatius (CASO), l'estudiant aprendrà  a dissenyar, implementar i analitzar sistemes operatius, l'entorn d'execució que ofereixen i avaluar la seva qualitat. Els continguts de l'assignatura cobreixen els temes d'arquitectures on s'executa un sistema operatiu, des d'entorns mòbils fins a servidors, suport hardware necessari per l'SO, tipus de serveis que ofereixen els sistemes operatius, requeriments de les aplicacions i temps real, control de l'energia, suport al paral·lelisme, desenvolupament d'aplicacions sobre l'SO, tècniques de virtualització i gestió de la garantia i seguretat del sistema i les aplicacions. L'avaluació de l'assignatura es farà mitjançant tres controls parcials al llarg del quadrimestre, un examen de laboratori i un examen final."
  },
  {
    "titulacio": "GEI",
    "sigles": "CPD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CPD",
    "nom": "Centres de Processament de Dades",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "AC",
    "desc": "L'assignatura està pensada perquè els estudiants entenguin la complexitat de funcionament d'un gran centre de processament de dades, coneguin els seus elements i les idees bàsiques de disseny y operació dels mateixos."
  },
  {
    "titulacio": "GEI",
    "sigles": "IM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/IM",
    "nom": "Internet Mòbil",
    "curs_obert": "Q2",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "La assignatura cobreix diferents aspectes relacionats amb l'Internet Mòbil, com ara les possibilitats i limitacions de tecnologies associades a la transmissió sense fills, xarxes cel.lulars, xarxes WiFi, i tecnologies de comunicació baix consum.  També el processament del senyal de sensors incorporats als telèfons mòvils (aceleròmetre, magnetòmetre i giroscop) i tecnologies de posicionament. A les sessions de cas d'us es tracten aspectes que no son purament tecnològics, però que son importants per entendre la evolució i possibilitats del'Internet mòbil, com ara la cadena de valor, ecosistema, markets d'aplicacions, models de negoci, etc. Més concretament, els temes tractats sòn els següents: La cadena de valor del Internet Mòbil. Transmissió ràdio. Xarxes cel.lulars. Xarxes WiFi i tecnologies de curt abast. Protocols de suport a la mobilitat. Sensors. Tècniques bàsiques de processament del senyal dels sensors (filtres, fusió de sensors). Tecnologies de posicionament. Aplicacions mòbils (plataformes, models de negoci, limitacions, etc)."
  },
  {
    "titulacio": "GEI",
    "sigles": "SDX",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SDX",
    "nom": "Sistemes Distribuïts en Xarxa",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Tecnologies de la informació)",
    "Departament": "AC",
    "desc": "Aquest curs proporciona una visió general dels principis fonalmentals dels sistemes distribuïts. Els continguts inclouen la programació distribuïda, la comunicació i la coordinació entre processos distribuïts, les transaccions distribuïdes, la replicació, els sistemes de fitxers distribuïts, i algunes aplicacions distribuïdes com la Web i els sistemes peer-to-peer. També s'inclou una introducció a temes avançats com el Cloud Computing, el Grid Computing, i el Mobile Computing ."
  },
  {
    "titulacio": "GEI",
    "sigles": "TCI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/TCI",
    "nom": "Transmissió i Codificació de la Informació",
    "curs_obert": "Q1",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Tecnologies de la informació)",
    "Departament": "MAT",
    "desc": "Una introducció als conceptes i algorismes dels codis correctors d'errors."
  },
  {
    "titulacio": "GEI",
    "sigles": "APC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/APC",
    "nom": "Arquitectura del PC",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "En aquesta assignatura els estudiants aprenen el funcionament dels diferents components d'un PC i d'altres dispositius actuals relacionats amb les TI. En l'assignatura es treballa la relació entre aquests dispositius i la sostenibilitat i el compromís social"
  },
  {
    "titulacio": "GEI",
    "sigles": "APSS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/APSS",
    "nom": "Habilitats Acadèmiques i Professionals d'Expressió Oral en Anglès",
    "curs_obert": "Q1, Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "THATC",
    "desc": "Aquest curs té com a objectiu ajudar els estudiants a desenvolupar les seves habilitats orals per comunicar-se en anglès en l'àmbit acadèmic i professional a nivell B2 del Marc Europeu Comú de Referència per a les Llengües (MECR). Tenint en compte el context internacional en què estem, el curs proporciona recursos als participants per millorar les seves habilitats de  comprensió  i expressió oral en anglès per participar amb èxit en activitats relacionades amb els seus estudis universitaris i les professions tècniques. Es posen en pràctica estratègies per ajudar els estudiants a convertir-se en oients més eficaços i a desenvolupar la seva fluïdesa i precisió en anglès per la interacció oral en diferents situacions comunicatives"
  },
  {
    "titulacio": "GEI",
    "sigles": "ASDP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ASDP",
    "nom": "Habilitats Acadèmiques Pel Desenvolupament de Projectes en Anglès",
    "curs_obert": "Q1, Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "THATC",
    "desc": "Aquest curs té com a objectiu desenvolupar la competència comunicativa dels estudiants en anglès pròpia d'entorns acadèmics a nivell B2 del Marc Europeu Comú de Referència (MECR). El curs proporciona als estudiants recursos per millorar les habilitats orals i escrites per comunicar-se de manera efectiva en el desenvolupament d'una activitat acadèmica. Més específicament, està dirigit a desenvolupar la seva fluïdesa, precisió i adequació per a dur a terme un projecte d'enginyeria en anglès tant de forma individual com collaborativa. S'apliquen els principis de la comunicació tècnica en l'àmbit internacional i els estudiants presenten informació tècnica, tant oralment com per escrit."
  },
  {
    "titulacio": "GEI",
    "sigles": "ASMI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ASMI",
    "nom": "Aspectes Socials i Mediambientals de la Informàtica",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "ESSI",
    "desc": "Estudiar els efectes i impactes socials i ambientals de la informàtica, la seva història i les lleis que afecten a la seva, pràctica sense oblidar-ne els aspectes ètics i de deontologia professional."
  },
  {
    "titulacio": "GEI",
    "sigles": "C",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/C",
    "nom": "Criptografia",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "MAT",
    "desc": "L'assignatura té com a objectiu presentar les tècniques modernes relacionades amb la confidenciabilitat, integritat, autenticitat i no repudi de la informació."
  },
  {
    "titulacio": "GEI",
    "sigles": "CCQ",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CCQ",
    "nom": "Computació i Criptografia Quàntiques",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "FIS",
    "desc": "El curs proporciona les bases imprescindibles de Física Quàntica per aplicar-les al món de la Computació i la Criptografia i en destaca els seus aspectes més importants:"
  },
  {
    "titulacio": "GEI",
    "sigles": "CDI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/CDI",
    "nom": "Compressió de Dades i Imatges",
    "curs_obert": "Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "MAT",
    "desc": "En termes generals, l'assignatura està dirigida a comprendre la importància de la compressió, com ara abans d'emmagatzemar o trametre dades, a distingir entre compressions fidels o amb pèrdues i adquirir criteris per decidir quin usar en cada cas, i a familiaritzar-se amb els corresponents aspectes algorísmics i computacionals."
  },
  {
    "titulacio": "GEI",
    "sigles": "DCS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/DCS",
    "nom": "Disseny de Corbes i Superfícies",
    "curs_obert": "Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "MAT",
    "desc": "Assignatura optativa que té per finalitat presentar una introducció als temes principals del disseny de corbes i superfícies per al seu ús en programes de gràfics i CAD/CAM. Per als diferents tipus de corbes i superfícies, es presentaran les seves definicions, propietats, i alguns aspectes d'implementació. El curs és teòric-pràctic. La part pràctica consisteix principalment en petits exercicis de programació que tenen com a objectiu familiaritzar-se amb la implementació i les propietats dels diferents tipus de corbes i superfícies."
  },
  {
    "titulacio": "GEI",
    "sigles": "EET",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/EET",
    "nom": "Educació, Enginyeria i Tecnologia",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "DAC;ICE",
    "desc": "L'educació és una sortida professional que està cobrant cada cop més importància entre els egressats del Grau en Enginyeria Informàtica. La ràpida evolució de la informàtica fa que cada vegada sigui més complicat estar al dia, cosa que està incrementant la necessitat de formació. Des dels professionals que han d'adaptar-se a noves metodologies i productes, fins a professionals de qualsevol branca que, amb l'increment de la transformació digital, han d'estar renovant i augmentant els seus coneixements en informàtica, passant per la reducció de la bretxa digital en general. Aquesta assignatura vol oferir les bases d'un ensenyament eficient però centrada en la informàtica i la tecnologia."
  },
  {
    "titulacio": "GEI",
    "sigles": "FDM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/FDM",
    "nom": "Física dels Dispositius de Memòria",
    "curs_obert": "Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "FIS",
    "desc": "L'estudiant ha de conèixer els fonaments del magnetisme, les ones electromagnètiques, la física quàntica i l'òptica per tal de comprendre les bases del funcionament de les memòries dels computadors (i d'una àmplia varietat de dispositius com mòbils, tauletes, etc.), així com d'instruments complementaris essencials per la lectura i escriptura de les memòries i la transmissió de dades, com són el làser o les fibres òptiques."
  },
  {
    "titulacio": "GEI",
    "sigles": "FOMAR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/FOMAR",
    "nom": "Física Orientada a la Modelització i l'Animació Realista",
    "curs_obert": "Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "FIS",
    "desc": "L'objectiu de l'assignatura és proporcionar a l'estudiant els coneixements de Física, i més concretament de Mecànica, que li permetran construir  models matemàtics físicament realistes de sistemes articulats (robots,  vehicles, organismes animats amb esquelet, etc)."
  },
  {
    "titulacio": "GEI",
    "sigles": "GCS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/GCS",
    "nom": "Gestió de la Ciberseguretat",
    "curs_obert": "Q1, Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "AC",
    "desc": "Aquesta assignatura te per objectiu proporcionar coneixements i recursos elementals sobre ciberseguretat orientats a la formació de professionals de l'enginyeria informàtica amb una base amplia sobre bones pràctiques a l'hora de protegir sistemes de l'àmbit de les TIC, mitigar vulnerabilitats,  i prevenir riscos. L'assignatura combina sessions de teoría amb pràctiques guiades orientades a l'assoliment de competències bàsiques en ciberseguretat."
  },
  {
    "titulacio": "GEI",
    "sigles": "GEOC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/GEOC",
    "nom": "Geometria Computacional",
    "curs_obert": "Q1",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "MAT",
    "desc": "En aquest curs es presenten els algorismes geomètrics més freqüents que es troben darrera de moltes aplicacions informàtiques en àmbits tals com la informàtica gràfica, la visualització, la reconstrucció de formes, la visió per ordinador, els sistemes d'informació geogràfica, la robòtica, etc."
  },
  {
    "titulacio": "GEI",
    "sigles": "I2R3",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/I2R3",
    "nom": "Introducció a la Recerca",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "3",
    "Tipus": "Optativa",
    "Departament": "FIB",
    "desc": "Aquesta assignatura té com a objectiu que l'alumne s'iniciï en les tasques de recerca  pròpies de la Enginyeria Informàtica. Es tracta que l'alumne es familiaritzi amb la recerca col·laborant amb els grups de recerca de la UPC relacionats L'alumne serà tutoritzat per un professor o professora del Grau en Enginyeria Informàtica. En aquest procés, podrà adoptar les pautes pròpies de la tasca de recerca, que poden incloure la participació en projectes existents, la comprovació d'hipòtesis, la redacció de publicacions científiques i, en general, aquelles activitats que el tutor o tutora consideri adequades per a contribuir a una formació inicial en la recerca."
  },
  {
    "titulacio": "GEI",
    "sigles": "I2R6",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/I2R6",
    "nom": "Introducció a la Recerca",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "FIB",
    "desc": "Aquesta assignatura té com a objectiu que l'alumne s'iniciï en les tasques de recerca  pròpies de la Enginyeria Informàtica. Es tracta que l'alumne es familiaritzi amb la recerca col·laborant amb els grups de recerca de la UPC relacionats L'alumne serà tutoritzat per un professor o professora del Grau en Enginyeria Informàtica. En aquest procés, podrà adoptar les pautes pròpies de la tasca de recerca, que poden incloure la participació en projectes existents, la comprovació d'hipòtesis, la redacció de publicacions científiques i, en general, aquelles activitats que el tutor o tutora consideri adequades per a contribuir a una formació inicial en la recerca."
  },
  {
    "titulacio": "GEI",
    "sigles": "LDPE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/LDPE",
    "nom": "Lideratge i Desenvolupament Professional a l'Enginyeria",
    "Crèdits": "3",
    "Tipus": "Optativa",
    "Departament": "TSC",
    "desc": "L'assignatura LDPE té com a objectiu principal estimular l'esperit crític dels estudiants i preparar-los per fer front a la transició al mercat laboral des de l'àmbit acadèmic. A més, busca fomentar una actitud proactiva en la gestió de la seva pròpia carrera professional, centrant-se en el creixement personal i professional al sector tecnològic. Per aconseguir-ho, s'estableixen pautes per al desenvolupament planificat de competències transversals clau a l'inici de la carrera, així com per adquirir gradualment habilitats de gestió i lideratge a mesura que es van assumint més responsabilitat a la feina, a mitjà i llarg termini"
  },
  {
    "titulacio": "GEI",
    "sigles": "MD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/MD",
    "nom": "Mineria de Dades",
    "curs_obert": "Q1, Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "EIO",
    "desc": "La filosofia de la Mineria de Dades és la conversió de dades en coneixement per a la presa de decisions i com a tal constitueix la fase central del procés d'extracció de coneixement a partir de bases de dades (KDD, Knowledge Discovery in Databases). La Mineria de Dades és un punt de trobada de diferents disciplines: l'estadística, l'aprenentatge automàtic (Machine Learning), les tècniques de bases de dades i els sistemes per a la presa de decisions. Juntes, permeten afrontar molts problemes actuals pel que fa al tractament de la informació."
  },
  {
    "titulacio": "GEI",
    "sigles": "PAE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/PAE",
    "nom": "Projecte Aplicat d'Enginyeria",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "DAC;ESSI;CS",
    "desc": "L'objectiu de l'assignatura és treballar en un projecte multi-disciplinar partint d'un repte definit per una empresa. Els estudiants treballaràn en el projecte en grups de 4, mentoritzats per una empresa i guiats per el professorat, per aportar solucions al repte. Els reptes variaran en funció de les empreses participants, però en general tenen un alt contingut d'innovació i creativitat. L'assignatura és apta per als estudiants de totes les especialitats i esta enfocada als de 4art curs, amb el requisit mínim d'haver aprovat 168 ECTS."
  },
  {
    "titulacio": "GEI",
    "sigles": "ROB",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/ROB",
    "nom": "Robòtica",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "ESAII",
    "desc": "Adquirir els coneixements bàsics sobre els robots manipuladores i mòbils fent èmfasis en els aspectes informàtics de la percepció, de la planificació i de l'actuació. Conèixer les principals àrees d'aplicació de la robòtica i les seves demandes, tant en l'àmbit industrial, com dels serveis. Adquirir la capacitat de dissenyar i desenvolupar sistemes basats en robots que permetin automatitzar una tasca o procés"
  },
  {
    "titulacio": "GEI",
    "sigles": "SLDS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/SLDS",
    "nom": "Software Lliure i Desenvolupament Social",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "En aquesta assignatura s'explica l'evolució històrica del programari lliure, les seves causes i raons de ser i la influència d'aquest tipus de programari en la societat i la seva evolució."
  },
  {
    "titulacio": "GEI",
    "sigles": "TGA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/TGA",
    "nom": "Targetes Gràfiques i Acceleradors",
    "curs_obert": "Q1",
    "idioma": "Castellà",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "En aquesta assignatura els estudiants estudiaran en profunditat el funcionament d'una targeta gràfica actual. Fent especial èmfasi en els seus punts forts i les seves limitacions arquitectónicas.También s'estudiarà la creixent relació d'aquests dispositius amb la Supercomputació i els nous acceleradors que estan apareixent al mercat."
  },
  {
    "titulacio": "GEI",
    "sigles": "VC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/VC",
    "nom": "Visió per Computador",
    "curs_obert": "Q1, Q2",
    "idioma": "Català",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "ESAII",
    "desc": "La visió per computador és una disciplina de la informàtica que tracta d'extreure i analitzar la informació d'interès continguda en una imatge o seqüencia d'imatges. Els camps d'aplicació creixen cada dia i van des del reconeixement de cares al diagnostic precoç de malalties, passant per la detecció i localització d'objectes i persones, la interacció gestual amb sistemes, el guiat de robots o la conducció automàtica."
  },
  {
    "titulacio": "GEI",
    "sigles": "VJ",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/VJ",
    "nom": "Videojocs",
    "curs_obert": "Q1, Q2",
    "idioma": "Català, Castellà",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "Aquesta assignatura introduirà els conceptes fonamentals de la programació de videojocs. Com a resultat els estudiants dissenyaran i desenvoluparan jocs utilitzant els coneixements adquirits a l'assignatura."
  },
  {
    "titulacio": "GEI",
    "sigles": "WSE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/graus/grau-en-enginyeria-informatica/pla-destudis/assignatures/WSE",
    "nom": "Habilitats d'Expressió Escrita en Anglès per a l'Enginyeria",
    "curs_obert": "Q1, Q2",
    "idioma": "Anglès",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "THATC",
    "desc": "Aquest curs té com a objectiu desenvolupar les habilitats d'escriptura dels estudiants per escriure documents acadèmics i professionals en anglès a nivell B2 del Marc Europeu Comú de Referència per a les Llengües (MECR). El curs proporciona als estudiants recursos per millorar les habilitats d'escriptura per tal de preparar documents escrits eficaços i també per comunicar-se amb els seus companys / collegues amb mitjans electrònics. El curs es centra en les habilitats dels participants per planificar un document d'acord amb una situació comunicativa definida, escriure un esborrany i revisar l'esborrany, assolint un document eficaç. Es posa l'accent en el desenvolupament de la fluïdesa, precisió i adequació en anglès per produir diferents tipus de documents per a finalitats acadèmiques i professionals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "AMMM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/AMMM-MIRI",
    "nom": "Mètodes Algorísmics per a Models Matemàtics",
    "curs_obert": "Q1, Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "DAC;CS",
    "desc": "La tasca de construir models matemàtics que representin problemes del món real i fer servir eines per solucionar aquests models és una tasca ubiqua a la informàtica. Tenir coneixements sobre aquestes eines i algorismes permet sospesar l'equilibri entre com de precisa és la formalització del problema i com de tractable és el model resultant."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CPDS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CPDS-MIRI",
    "nom": "Concurrència, Paral·lelisme i Sistemes Distribuïts",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "CS;DAC",
    "desc": "Aquest curs té com a objectiu proporcionar les bases sobre la computació com un conjunt de tasques que poden estar executant al mateix temps i que poden interactuar entre elles. Aquestes tasques poden ser executades en un o multiples processadors o distribuïts a través d'una xarxa. El curs presenta els models, els problemes, els algoritmes i sistemes que es centren en tres aspectes/mòduls principals: concurrència (múltiples processos que interactuen entre si), paral·lelisme (multiples nuclis o processadors), i distribució (multiples ordinadors en una xarxa)."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SMDE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SMDE-MIRI",
    "nom": "Modelatge Estadístic i Disseny d'Experiments",
    "curs_obert": "Q1, Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "EIO",
    "desc": "L'objectiu del curs es dotar a l'estudiant de les eines necessàries per enfrontar-se a sistemes complexos emprant eines de modelatge estadístic. Així mateix s'introduirà a l'estudiant en diferents tècniques de disseny d'experiments."
  },
  {
    "titulacio": "MIRI",
    "sigles": "TMIRI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/TMIRI-MIRI",
    "nom": "Tècniques i Metodologia de la Innovació i la Recerca en Informàtica",
    "curs_obert": "Q1, Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "En aquest curs s'aborden diferents aspectes que poden ser útils per a persones que dirigiran la seva carrera professional al món acadèmic o de la innovació tecnològica."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SIRI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SIRI-MIRI",
    "nom": "Seminaris d'Innovació i Recerca en Informàtica",
    "curs_obert": "Q1, Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria",
    "Departament": "DAC;FIB;MAT;ESSI",
    "desc": "Els seminaris s'organitzen en activitats, avaluables per separat, per triar entre un conjunt divers d'activitats, i poden ser diferents cada curs acadèmic. La informació detallada dels seminaris que s'estan fent o ja s'han fet aquest curs acadèmic  està pública a la secció de seminaris al màster MIRI ("
  },
  {
    "titulacio": "MIRI",
    "sigles": "ADS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ADS-MIRI",
    "nom": "Estructures de Dades Avançades",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "Efficient strategies and techniques for \"structured data\" are key in modern computer science to design fast algorithms useful in a variety of every day applications (like web archiving, mail servers, network routers, video games)."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CC-MIRI",
    "nom": "Complexitat Computacional",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "The theory of computational complexity provides tools for analysing the minimal amount of computational resources that are needed for algorithmically solving a problem. The classical resources that are studied are time and memory usage, but more recent developments have shown that several other computational resources are equally relevant, such as the amount of randomness needed by the algorithm, or the depth of the circuit that implements the algorithm as a measure of its parallelism. Besides introducing the basics of the theory, in this course we will spend some time discussing the relevance of the famous P vs. NP problem and its relatives to computer science and technology, but also its relevance to other areas of science."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CPS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CPS-MIRI",
    "nom": "Resolució de Problemes Combinatoris",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "Un problema combinatori consisteix en, donada una col·lecció finita d'objectes i un conjunt de restriccions, trobar un objecte de la col·lecció que satisfà totes les restriccions (i possiblement que optimitzi una funció objectiu). Els problemes combinatoris són omnipresents i tenen una gran importància pràctica. En aquest curs estudiarem tres paradigmes generals diferents per resoldre problemes combinatoris: programació lineal, satisfactibilitat proposicional i programació amb restriccions. Per a cadascun d'ells, n'estudiarem els fonaments algorítmics, així com les tècniques de modelització."
  },
  {
    "titulacio": "MIRI",
    "sigles": "RA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/RA-MIRI",
    "nom": "Algorismes Aleatoris",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "L'objectiu d'aquest curs és presentar la potència i la varietat d'algorismes aleatoris i aprofundir en l'anàlisi probabilística d'algorismes."
  },
  {
    "titulacio": "MIRI",
    "sigles": "ADM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ADM-MIRI",
    "nom": "Algorísmia per a Mineria de Dades",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "La mineria de dades és el procés d'extracció i descoberta de patrons en conjunts de dades grans (generalment) que impliquen mètodes a la intersecció de l'aprenentatge automàtic, les estadístiques multivariants i els sistemes de bases de dades. Actualment utilitza aquests mètodes d'una manera principiada per formar un procés d'extrem a extrem, des d'un conjunt de dades en brut fins a informació d'alt nivell, expressada en una estructura comprensible per a l'usuari final."
  },
  {
    "titulacio": "MIRI",
    "sigles": "AGT",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/AGT-MIRI",
    "nom": "Teoria de Jocs Algorísmica",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "Mentres que les  Ciències de la Computació s'esforçan per comprendre l'Internet i les seves capacitats, els informàtics  estan incorporant conceptes i metodologies de l'economia i de la teoria de jocs en la seva disciplina. En les últimes dècades, hi ha hagut un enorme creixement en la investigació, centrada al voltant de les següents preguntes: ¿Quines eines de la  teoria de jocs són aplicables als sistemes informàtics? ¿Fins a quin punt el desviament del rendiment d'un sistema, amb respecte de l'òptim, és degut al conflicte d'interessos dels seus usuaris i administradors? ¿Com podem dissenyar un sistema en el que el seu funcionament és robust respecte al possible conflicte d'interessos dins del sistema?"
  },
  {
    "titulacio": "MIRI",
    "sigles": "AVLSI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/AVLSI-MIRI",
    "nom": "Algorismes per a VLSI",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació Avançada)",
    "Departament": "CS",
    "desc": "Most of the design flow of an integrated circuit is automated, starting from the specifications using Hardware Description Languages until reaching the physical layout. The flow goes through through different synthesis and analysis phases: behavioral synthesis, logic synthesis, floorplanning, placement, routing, timing analysis, formal verification, etc. This course will review the most important algorithmic aspects in design automation of electronic circuits. A significant part of the course will be devoted to algorithms for minimization of Boolean functions and representation with logic gates. The algorithms for physical design (floorplanning, placement and routing) will be mostly based on solving problems with graph models."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CSN",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CSN-MIRI",
    "nom": "Xarxes Socials i Complexes",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "Networks are structures that show up where there is any kind of interaction: in social behavior, in biological, physical or chemical processes, among many others. Important real-world processes such as the spread of disease or people's buying patterns can be explained through the use and study of networks. This course will cover the fundamental aspects of networks: what are they and how can we measure them? What are their characteristics and properties? What type of processes are they able to carry out? How can we model them? Can we predict their behavior?"
  },
  {
    "titulacio": "MIRI",
    "sigles": "A3DM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/A3DM-MIRI",
    "nom": "Modelat Avançat en 3d",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "Aquest curs cobreix les tècniques, algorismes i estructures de dades utilitzades per a generar, representar i consultar models geomètrics de sòlids i superfícies. El curs tracta diverses tècniques de modelatge, incloent representacions de fronteres, representacions implícites, instanciació i combinacions booleanes de sòlids, així com modelatge procedimental. També discutirem estructures de dades efectives per representar diversos tipus d'objectes, així com el procés d'adquisició de models a partir d'objectes reals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "FRR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/FRR-MIRI",
    "nom": "Representació Realista d'Alta Velocitat",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "L'objectiu d'aquest curs és presentar diverses tècniques i algorismes de representació realista. Al llarg del recorregut visitarem alguns conceptes com ara ombres, oclusió ambient, etc., i introduirem com aconseguir aquests efectes usant GPU."
  },
  {
    "titulacio": "MIRI",
    "sigles": "GTCG",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/GTCG-MIRI",
    "nom": "Eines Geomètriques per a Gràfics per Computador",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "MAT",
    "desc": "Aquest curs ha estat dissenyat per proporcionar als estudiants les eines geomètriques usades més freqüentment en computació gràfica. Aixó inclou la descripció matemàtica d'objectes geomètrics, rudiments de geometria diferencial de corbes i superfícies, càlcul d'interseccions, transformacions afins i projeccions, i alguns algorismes geomètrics bàsics."
  },
  {
    "titulacio": "MIRI",
    "sigles": "VAR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/VAR-MIRI",
    "nom": "Realitat Virtual i Augmentada",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "Aquest curs presenta els algoritmes i tècniques necessàries per desenvolupar i desplegar aplicacions de realitat virtual i realitat augmentada. El curs cobrirà VR i maquinari AR, visió estereoscòpica, VR AR i el desenvolupament de programari, interfícies d'usuari 3D i presència."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CA-MIRI",
    "nom": "Animació per Computador",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "We introduce the essential tools for the animation of different objects, ranging from simple point particles to articulated humanoids. Continuous physically-based animation is compared to discrete, mainly rule based, animation in order to obtain a wide picture of the present animation methods. Character animation techniques are studied ranging from one character to large crowds."
  },
  {
    "titulacio": "MIRI",
    "sigles": "GPR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/GPR-MIRI",
    "nom": "Processat en Geometria",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "This course explores some of the most important algorithms for processing polygonal meshes (mainly triangular meshes). The main topics covered will include the construction of meshes from real objects, the filtering of geometric and topological noise, the parametrization of meshes, their deformation and edition, and their compression."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SRGGE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SRGGE-MIRI",
    "nom": "Renderització Escalable en Gràfics i Videojocs",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "Aquest curs introduirà les diverses tècniques que permeten la visualització interactiva i la manipulació d'objectes i escenes molt complexos. Si bé hi ha hagut un salt en la potència del maquinari de gràfics, és possible generar conjunts de dades més complexos a través dels avenços en el modelatge 3D, simulació i captura de dades. Per tant, la necessitat de tractar aquests models massius sorgeix en camps com ara la visualització científica, CAD, el patrimoni cultural, motors de videojocs i altres. Els estudiants estaran exposats a una representació jeràrquica d'escenes, la simplificació de models i algorismes de visibilitat. Com a resultat, s'obtindrà una visió global del problema i un ampli coneixement de les solucions actuals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SV",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SV-MIRI",
    "nom": "Visualització Científica",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Gràfics i Realitat Virtual)",
    "Departament": "CS",
    "desc": "En aquesta assignatura es donaran coneixements bàsics de visualització de dades, visualització d'informació i visualització científica."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CNANM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CNANM-MIRI",
    "nom": "Arquitectura de Xarxes de Computadors i Gestió de Xarxes",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "L'objectiu de l'assignatura és proporcionar els coneixements bàsics dels mecanismes i conceptes avançats sobre les xarxes de computadors. Aquests coneixements inclouen les arquitectures de xarxa i les tecnologies emprades així com els algorismes bàsics en el disseny del protocols de comunicació. El curs inclou els principis bàsics de commutació i transmissió, comunicacions sense fils i a través de medi compartit, algorismes d'encaminament, arquitectura de xarxa i interconnexió de xarxes, gestió de recursos i serveis de xarxa. Evolució de l'arquitectura d'Internet i de les relacions entres els diferents actors. Arquitectura de les xarxes 5G."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SANS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SANS-MIRI",
    "nom": "Anàlisi Estadística de Xarxes i Sistemes",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "The course covers basic techniques used in the statistical analysis of networks and systems. It first reviews and extends basic concepts on probability, information theory, and linear algebra. Then it presents basic estimation techniques. It covers the basic approaches of Machine Learning for regression and classification.  Finally presents linear methods for dimensionality reduction."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SNM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SNM-MIRI",
    "nom": "Modelatge Estocàstic de Xarxes",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "Aquest curs és una introducció als processos estocàstics i la seva aplicació a les xarxes de computadors. Els processos estocàstics es descriuen com una seqüència de variables aleatòries que modelen l'evolució d'un sistema. El curs donarà un bagatge sòlid a les cadenes de Markov, l'eina analítica més popular per modelar processos estocàstics. Es pretén que el curs sigui el més pràctic possible, utilitzant problemes senzills per aplicar tots els resultats teòrics presentats al curs. Aproximadament la meitat de les classes teòriques es dedicaran a resoldre problemes. L'objectiu és que mitjançant la solució de molts exemples, els estudiants aprenguin l'art del modelatge matemàtic mitjançant cadenes de Markov."
  },
  {
    "titulacio": "MIRI",
    "sigles": "TOML",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/TOML-MIRI",
    "nom": "Temes Sobre Optimització i Aprenentatge Automàtic",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "L'objectiu d'aquest curs és proporcionar a l'alumne una formació en metodologies en el disseny avançat de mecanismes mitjançant l'optimització convexa no lineal, l'aprenentatge automàtic i l'aprenentatge profund que es poden aplicar a xarxes d'ordinadors i sistemes distribuïts. En particular, explorarem models no lineals doptimització, mètodes daprenentatge màquina basats en kernels, i IA generativa."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CCBDA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CCBDA-MIRI",
    "nom": "Computació al Núvol i Anàlisi de Dades Massives",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "AC",
    "desc": "La computació al núvol és un model de servei per a computació distribuïda a gran escala basada en una infraestructura concentrada i un conjunt de serveis collaboratius sobre els quals un conjunt d'aplicacions es poden implementar i executar a través de la xarxa."
  },
  {
    "titulacio": "MIRI",
    "sigles": "DS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/DS-MIRI",
    "nom": "Sistemes Descentralitzats",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "L'objectiu d'aquest curs és introduint a l'estudiant en els temes d'investigació relacionats amb sistemes descentralitzats  i escalables. El programa consistirà en xarxes sobreposats, propietats topològiques de l'Internet, coordenades de xarxa, temes de descentralització i sistemes (replicació optimista, publicar-subscriure, distribució de continguts, computació voluntària, xarxes de sensor), la escalabilidad en propietats de sistemes, assumptes en sistemes de gran escala (virtualització, orientació a serveis i composició, disponibilitat, localitat, rendiment i adaptació), models de sistemes (teoria de jocs, econòmic, evolutiu, control, complexitat), models arquitectònics (multi-tier, cluster, grid, núvol, SaaS), middleware i aplicacions (Grid/Cloud, coordinació, computació, emmagatzematge, web, distribució de continguts,  sistemes o serveis d'escala Internet)."
  },
  {
    "titulacio": "MIRI",
    "sigles": "FINE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/FINE-MIRI",
    "nom": "Xarxes d'Internet del Futur",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "L'objectiu d'aquest assignatura és oferir una àmplia visió de l'espectre de tecnologies involucrades en Internet i la seva evolució durant les últimes dècades, així com l'evolució que es preveu a partir d'ara a curt, mitjà i llarg termini. El temari de l'assignatura aborda els següents temes principals: Evolució d'internet, Arquitectura de la Internet del futuro, Tecnologies de xarxes troncals, Enginyeria de tràfic, Monitoratge i anàlisi de tràfic IP, Eficiència energètica a Internet i d'altres temes que estiguin d'actualitat."
  },
  {
    "titulacio": "MIRI",
    "sigles": "IAS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/IAS-MIRI",
    "nom": "Aplicacions i Seguretat en Internet",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "Aquesta assignatura cobreix aspectes d'investigació de l'àrea, molt activa, de les aplicacions d'Internet i la seva seguretat. El focus està en les aplicacions multimèdia, però també es consideren altres àrees, com eHealth. Per tant, el contingut, les metadades i els protocols de transmissió són rellevants."
  },
  {
    "titulacio": "MIRI",
    "sigles": "ADM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ADM-MIRI",
    "nom": "Algorísmia per a Mineria de Dades",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "La mineria de dades és el procés d'extracció i descoberta de patrons en conjunts de dades grans (generalment) que impliquen mètodes a la intersecció de l'aprenentatge automàtic, les estadístiques multivariants i els sistemes de bases de dades. Actualment utilitza aquests mètodes d'una manera principiada per formar un procés d'extrem a extrem, des d'un conjunt de dades en brut fins a informació d'alt nivell, expressada en una estructura comprensible per a l'usuari final."
  },
  {
    "titulacio": "MIRI",
    "sigles": "AHLT",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-intelligencia-artificial/pla-destudis/assignatures/AHLT-MAI",
    "nom": "Tecnologies Avançades del Llenguatge Humà",
    "curs_obert": "Q2",
    "Crèdits": "5",
    "Tipus": "",
    "Departament": "CS;TSC",
    "desc": "This course offers an in-depth coverage of main basic tasks for Natural Language Processing. We will present fundamental models and tools to approach a variety of Natural Language Processing tasks, ranging from named entity recognition to syntactic processing and document classification. The flow of the course is along two main axis: (1) computational formalisms to describe natural language processes, and (2) statistical and machine learning methods to acquire linguistic models from large data collections and solve specific linguistic tasks"
  },
  {
    "titulacio": "MIRI",
    "sigles": "BDM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/BDM-MIRI",
    "nom": "Administració de Dades Massives",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESSI",
    "desc": "The main goal of this course is to analyze the technological and engineering needs of Big Data Management. The enabling technology for such a challenge is cloud services, which provide the elasticity needed to properly scale the infrastructure as the needs of the company grow. Thus, students will learn advanced data management techniques (i.e., NOSQL solutions) that also scale with the infrastructure. Being Big Data Management the evolution of Data Warehousing, such knowledge (see the corresponding subject in Data Science speciality for more details on its contents) is assumed in this course , which will specifically focus on the management of data Volume and Velocity."
  },
  {
    "titulacio": "MIRI",
    "sigles": "BSG",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-ciencia-de-dades/pla-destudis/assignatures/BSG-MDS",
    "nom": "Bioinformàtica i Genètica Estadística",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS;EIO",
    "desc": "Bioinformatics and Statistical Genetics"
  },
  {
    "titulacio": "MIRI",
    "sigles": "IRRS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-ciencia-de-dades/pla-destudis/assignatures/IRRS-MDS",
    "nom": "Recuperació de la Informació i Sistemes Recomanadors",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "La informació emmagatzemada digitalment en moltes organitzacions, o col·lectivament en la web, és avui dia prou gran perquè trobar allò que es busca sigui generalment complicat. El camp conegut com a \"Information Retrieval\" tracta dels mètodes per organitzar informació i permetre després als usuaris trobar-la de manera còmoda i eficient. Cobrirem les tècniques bàsiques de cerca de documentació textual basada en paraules clau. Examinarem després el cas de la cerca en la web, on la presència d'hiperenllaços pot usar-se no sols per dirigir la cerca sinó per valorar l'interès de cada pàgina - és el cas del conegut algorisme PageRank. Veurem l'extensió d'aquestes tècniques al cas de les xarxes socials on el graf d'interaccions entre usuaris proporciona molta informació de què pot interessar a cadascun. Finalment, estudiarem com les tecnologies de Big Data i de recomanació es complementen en sistemes de cerca d'informació actuals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "VBP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/VBP-MIRI",
    "nom": "Viabilitat de Projectes Empresarials",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "OE",
    "desc": "Els titulats universitaris poden trobar-se en la situació de tenir que analitzar o assumir el projecte de crear la seva pròpia empresa. Això és especialment cert en el cas dels informàtics de qualsevol camp relacionat amb Business Intelligence (BI) i Big Data (BD) o, més en general, en el món dels serveis. Hi ha moments en la carrera professional en els quals cal que sigui capaç d'avaluar o jutjar la idoneïtat dels negocis empreses o promogudes per tercers, o conèixer les possibilitats de succés d'un nou servei. És per això que aquesta assignatura es centra a proporcionar als estudiants un coneixement de les principals tècniques utilitzades en l'anàlisi de la viabilitat de les noves iniciatives empresarials: la creació d'empreses o la implementació de nous projectes en el món dels serveis o en el camp específic del BI. Aquesta assignatura, orientada a projectes i eminentment pràctica, té com a objectiu que cada alumne pugui elaborar un pla de negoci el més realista possible."
  },
  {
    "titulacio": "MIRI",
    "sigles": "MA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/MA-MIRI",
    "nom": "Arquitectura de Multiprocessadors",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "."
  },
  {
    "titulacio": "MIRI",
    "sigles": "OS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/OS-MIRI",
    "nom": "Sistemes Operatius",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "L'objectiu d'aquest curs és doble. Per un costat, els estudiants obtindran un coneixement detallat de mecanismes com la gestió de memòria que els ajudarà a entendre el suport que dona l'arquitectura al sistemes operatius (mecanismes que es descriuran detalladament a assignatures d'arquitectura de computadors). Per un altre costat, l'estudiant aprendrà com els sistemes operatius gestionen els recursos en un sistema d'altes prestacions. Dins d'aquesta part s'inclou la gestió d'aplicacions, sistemes d'emmagatzemament, eficiència energètica, i virtualització entre d'altres."
  },
  {
    "titulacio": "MIRI",
    "sigles": "PA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/PA-MIRI",
    "nom": "Arquitectura del Processador",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "Aquest és un curs de màster sobre l'evolució de l'arquitectura de computadors y els factors que han influenciat el disseny dels elements de hardware i software dels sistemes actuals. El curs té un èmfasi especial en les decisions de disseny des d'un punt de vista cost/rendiment. El curs cobreix els aspectes fonamentals del disseny de processadors actual: rendiment i cost, joc d'instruccions, segmentació, caches, memòria física, suport a la memòria virtual, processadors superescalars i execució fora d'ordre."
  },
  {
    "titulacio": "MIRI",
    "sigles": "APA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/APA-MIRI",
    "nom": "Arquitectura Avançada del Processador",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "Aquest curs se centra en l'estudi de la microarquitectura del processador. S'analitzen diferents esquemes microarquitectònics per millorar el rendiment, disminuir la complexitat i el cost, reduir el consum d'energia i incrementar la fiabilitat dels microprocessadors. S'estudien les diferents famílies de microarquitectures contemporànies: processadors superescalars, multifil, multinucli, vectorials i gràfics, amb un especial èmfasi en tendències futures."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CHPC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CHPC-MIRI",
    "nom": "Compiladors per Computadors d'Altes Prestacions",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "Optimizing compilers play a critical role in modern computer systems ranging from mobile devices to supercomputers. Compilers can optimize for performance, power consumption and/or code size. Practically all computer scientists and engineers may benefit for a deep knowledge of compiler optimizations: programmers and application optimizers write programs that are better optimized by the compiler, computer designers design hardware features that are easy to use by compilers, and finally compiler writers develop new compiler optimizations. This course covers optimizations and aspects of the compiler back-end and middle-end such as: instruction level parallelism, memory hierarchy optimizations, data level parallelism and thread level parallelism."
  },
  {
    "titulacio": "MIRI",
    "sigles": "PD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/PD-MIRI",
    "nom": "Disseny del Processador",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "This course offers a more advanced treatment of digital design in the context of microprocessors. Students are introduced to a design methodology which encompasses the range from architectural and logic models to system simulations.  The course includes the design flow: logic synthesis, placement and routing; design verification; computer-aided digital system modeling, performance and power estimation, and design implementation with field programmable gate arrays. Alternative implementations (ASICs, PLAs) will also be discussed."
  },
  {
    "titulacio": "MIRI",
    "sigles": "PPTM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/PPTM-MIRI",
    "nom": "Eines i Models de Programació Paral·lela",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "Aquest curs presenta els conceptes principals darrere dels models de programació paral·lels i la seva implementació. El curs analitza el paper del programador, el compilador, l'entorn d'execució i el sistema operatiu en la cerca d'entorns de programació productius i eficients en la seva implementació. El curs també presenta les eines necessàries per entendre el comportament de les aplicacions paral·leles quan s'executen en arquitectures de supercomputació actuals (basades en un conjunt de nodes de memòria distribuïda, cadascun construït a partir pels actuals xips amb múltiples nuclis i/o acceleradors). El curs serà molt pràctic amb tasques d'analisi i paral·lelització utilitzant diferents eines (Extrae, Paraver i DImemas) i models de programació (OpenMP, OmpSs, MPI o CUDA), endinsant-nos en la seva implementació."
  },
  {
    "titulacio": "MIRI",
    "sigles": "PV",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/PV-MIRI",
    "nom": "Verificació de Processadors",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "En completar aquest curs, els estudiants seran capaços d'entendre el paper crític de la verificació pre-silici en el disseny modern de microprocessadors. Podran identificar i aplicar diverses metodologies i tècniques de verificació, així com utilitzar eines de simulació per depurar i analitzar el comportament del disseny. Al llarg del curs, els estudiants desenvoluparan plans de verificació i crearan bancs de proves efectius utilitzant llenguatges de descripció de maquinari i llenguatges de verificació."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SA-MIRI",
    "nom": "Arquitectura de Supercomputadors",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "This course introduces the fundamentals of high-performance and parallel computing, designed for scientists and engineers aiming to develop skills in working with supercomputers, the forefront of high-performance computing technology."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SCA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SCA-MIRI",
    "nom": "Supercomputació per Aplicacions Exigents",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "Aquest curs cobreix l'explotació de la supercomputació per a una varietat d'aplicacions científiques i d'enginyeria. Els continguts abasten diversos dominis d'aplicació tant en les àrees numèriques com no numèriques."
  },
  {
    "titulacio": "MIRI",
    "sigles": "BDM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/BDM-MIRI",
    "nom": "Administració de Dades Massives",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESSI",
    "desc": "The main goal of this course is to analyze the technological and engineering needs of Big Data Management. The enabling technology for such a challenge is cloud services, which provide the elasticity needed to properly scale the infrastructure as the needs of the company grow. Thus, students will learn advanced data management techniques (i.e., NOSQL solutions) that also scale with the infrastructure. Being Big Data Management the evolution of Data Warehousing, such knowledge (see the corresponding subject in Data Science speciality for more details on its contents) is assumed in this course , which will specifically focus on the management of data Volume and Velocity."
  },
  {
    "titulacio": "MIRI",
    "sigles": "VBP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/VBP-MIRI",
    "nom": "Viabilitat de Projectes Empresarials",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "OE",
    "desc": "Els titulats universitaris poden trobar-se en la situació de tenir que analitzar o assumir el projecte de crear la seva pròpia empresa. Això és especialment cert en el cas dels informàtics de qualsevol camp relacionat amb Business Intelligence (BI) i Big Data (BD) o, més en general, en el món dels serveis. Hi ha moments en la carrera professional en els quals cal que sigui capaç d'avaluar o jutjar la idoneïtat dels negocis empreses o promogudes per tercers, o conèixer les possibilitats de succés d'un nou servei. És per això que aquesta assignatura es centra a proporcionar als estudiants un coneixement de les principals tècniques utilitzades en l'anàlisi de la viabilitat de les noves iniciatives empresarials: la creació d'empreses o la implementació de nous projectes en el món dels serveis o en el camp específic del BI. Aquesta assignatura, orientada a projectes i eminentment pràctica, té com a objectiu que cada alumne pugui elaborar un pla de negoci el més realista possible."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CV",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/assignatures/CV",
    "nom": "Visió per Computador",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESAII",
    "desc": "La visió per computador és una disciplina de la informàtica que s'encarrega d'extreure informació rellevant a partir d'imatges o seqüències d'imatges. Els seus àmbits d'aplicació són cada cop més amplis i abasten des del reconeixement facial fins al diagnòstic precoç de malalties, passant per la detecció i localització d'objectes i persones, la interacció gestual amb sistemes, la navegació de robots o la conducció autònoma."
  },
  {
    "titulacio": "MIRI",
    "sigles": "I2P",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/I2P-MIRI",
    "nom": "Projecte d'Innovació Interdisciplinari",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "AC",
    "desc": "L'objectiu d'aquest curs és experimentar la innovació en primera persona. Treballaràs en equips multi-disciplinaris composats per estudiants d'enginyeria (UPC) així com d'una escola de negocis (ESADE) per proveir solucions a reptes d'innovació reals. Aquests reptes están definits per diferents organitzacions, provenen d'startups, grups de recerca, empreses locals així com multinacionals. Com equip, produiràs solucions tècniques innovadores sostenibles financerament, testejades en un context real i, al final del curs, la presentaràs a persones rellevants de l'organització. Aquest curs esta organitzat conjuntament amb el  MSc Innovation and Entrepreneurship (ESADE). Pots trobar més informació sobre el curs així com reptes i solucions passats a la web de l'assignatura."
  },
  {
    "titulacio": "MIRI",
    "sigles": "I2RM3",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/assignatures/I2RM3",
    "nom": "Introducció a la Recerca",
    "curs_obert": "Q1, Q2",
    "Crèdits": "3",
    "Tipus": "",
    "Departament": "FIB",
    "desc": "Aquesta assignatura té com a objectiu que l'alumne s'iniciï en tasques de recerca. L'alumne serà tutoritzat per un professor de màster de la FIB. En aquest procés, l'estudiant ha d'exposar-se a tasques pròpies de la recerca: llegir i entendre articles científics, familiaritzar-se amb solucions desenvolupades als grups de recerca, desenvolupar petites deltes d'aquestes solucions (noves hipòtesis i validació / refutació d'aquestes), ajudar a l'implementació de prototips de idees innovadores de recerca i reportar les tasques fetes en format article seguint l'estructura habitual (introducció, estat de l'art, formalització de la solució creada, experimentació i conclusions)."
  },
  {
    "titulacio": "MIRI",
    "sigles": "I2RM6",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/assignatures/I2RM6",
    "nom": "Introducció a la Recerca",
    "curs_obert": "Q1, Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "FIB",
    "desc": "Aquesta assignatura té com a objectiu que l'alumne s'iniciï en tasques de recerca. L'alumne serà tutoritzat per un professor de màster de la FIB. En aquest procés, l'estudiant ha d'exposar-se a tasques pròpies de la recerca: llegir i entendre articles científics, familiaritzar-se amb solucions desenvolupades als grups de recerca, desenvolupar petites deltes d'aquestes solucions (noves hipòtesis i validació / refutació d'aquestes), ajudar a l'implementació de prototips de idees innovadores de recerca i reportar les tasques fetes en format article seguint l'estructura habitual (introducció, estat de l'art, formalització de la solució creada, experimentació i conclusions)."
  },
  {
    "titulacio": "MIRI",
    "sigles": "IQL",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/assignatures/IQL",
    "nom": "Introducció a la Lingüística Quantitativa",
    "curs_obert": "Q2",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "CS",
    "desc": "La lingüística quantitativa és una branca de la lingüística que s'ocupa principalment dels patrons estadístics del llenguatge (les anomenades lleis lingüístiques), la seva explicació i la construcció de teories. El curs és rellevant per a qualsevol persona interessada en com són les llengües (i la comunicació animal) i per què."
  },
  {
    "titulacio": "MIRI",
    "sigles": "MLOPS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-ciencia-de-dades/pla-destudis/assignatures/MLOPS-MDS",
    "nom": "Sistemes d'Aprenentatge Automàtic en Producció",
    "curs_obert": "Q1",
    "Crèdits": "6",
    "Tipus": "",
    "Departament": "ESSI",
    "desc": "En aquest curs, introduïm un enfocament d'aprenentatge basat en projectes per a l'ensenyament de MLOps, centrat en la demostració i l'experiència amb pràctiques i eines d'enginyeria de software emergent per a automatitzar la construcció de components habilitats per a ML. El curs inclou sessions de laboratori que cobreixen el cicle de vida del component ML de principi a fi, des de la construcció del model fins al desplegament en producció."
  },
  {
    "titulacio": "MIRI",
    "sigles": "ADSDB",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ADSDB-MIRI",
    "nom": "Algorismes, Estructures de Dades i Bases de Dades",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS;ESSI",
    "desc": "This is a fundamental course that covers basic concepts on algorithms, data structures and databases. This course spans two different tracks: one for students who have a major in Computer Science and another track for the rest."
  },
  {
    "titulacio": "MIRI",
    "sigles": "AM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/AM-MIRI",
    "nom": "Modelatge Avançat",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": "This course covers the techniques, algorithms and data structures used to acquire, represent and query geometric models of solids and surfaces. The course will cover various modeling techniques, including boundary representations, implicit representations, instantiation and Boolean combinations of shapes, as well as procedural modeling. We will also discuss effective data structures for representing various types of objects, as well as the process of acquiring models from real objects."
  },
  {
    "titulacio": "MIRI",
    "sigles": "ANLP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ANLP-MIRI",
    "nom": "Processament Avançat del Llenguatge Natural",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": "Can a machine learn to correct the grammaticality of text? Can a machine learn to answer questions we make in plain English? Can a machine learn to translate languages, using Wikipedia as a training set?"
  },
  {
    "titulacio": "MIRI",
    "sigles": "ASE",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ASE-MIRI",
    "nom": "Enginyeria del Software Avançada",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "As systems and services become more pervasive, large-scale and complex, new methods are needed to deal with the complexity of conceiving them, designing them and implementing them. ASE will expose students to software engineering methods that provide them the ability to develop software systems and services in a more efficient and effective way. The presented methods will embrace the full range of software engineering activities, from requirements engineering to software validation, from formal models to practical artifacts, from products to processes. The program of the course will evolve continuously as new methods emerge and others become obsolete. Practical application to a project will be part of the course"
  },
  {
    "titulacio": "MIRI",
    "sigles": "ASM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ASM-MIRI",
    "nom": "Modelat Estadístic Avançat",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "EIO;DAC",
    "desc": "L'assignatura fa un recorregut al llarg de diferents models estadístics de regressió: model lineal generalitzat,regressió no paramètrica, regressió no paramètrica generalitzada, models Bayesians. Es fa èmfasi en la selecció i validació dels models. Una part fonamental del curs és l'estudi de casos reals, tant per part dels professors com per part dels estudiants a les tasques programades setmanalment."
  },
  {
    "titulacio": "MIRI",
    "sigles": "BIP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/BIP-MIRI",
    "nom": "Projecte d'Intel·ligència Empresarial",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "Currently, Big Data and Business Intelligence are two main economical drivers of our society. Most companies are shifting to a data-driven paradigm where (digital) data gathered is properly stored, managed and exploited in order to extract objective evidences to support their day-by-day decision making processes."
  },
  {
    "titulacio": "MIRI",
    "sigles": "BSG",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/BSG-MIRI",
    "nom": "Bioinformàtica i Genètica Estadística",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "EIO;CS",
    "desc": "Bioinformàtica i Estadística Genètica"
  },
  {
    "titulacio": "MIRI",
    "sigles": "CLC",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CLC-MIRI",
    "nom": "Cloud Computing",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "Cloud computing is a service model for large-scale distributed computing based on a converged infrastructure and a set of common services over which applications can be deployed and run over the network.  This course about Cloud computing is divided into two main parts, one centered in the key concepts behind the Cloud paradigm and another more practical that deals with the related technologies."
  },
  {
    "titulacio": "MIRI",
    "sigles": "CN",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/CN-MIRI",
    "nom": "Xarxes de Computadors",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "L'objectiu de l'assignatura és proporcionar els coneixements bàsics dels mecanismes i conceptes fonamentals sobre les xarxes de computadors. Aquests coneixements inclouen les arquitectures de xarxa i les tecnologies emprades així com els algorismes bàsics en el disseny del protocols de comunicació. El curs inclou els principis bàsics de commutació i transmissió, comunicacions sense fils i a través de medi compartit, algorismes d'encaminament, arquitectura de xarxa i interconnexió de xarxes, gestió de recursos i serveis de xarxa."
  },
  {
    "titulacio": "MIRI",
    "sigles": "DAKD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/DAKD-MIRI",
    "nom": "Anàlisi de Dades i Descobriment de Coneixement",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Ciència de les Dades)",
    "Departament": "CS",
    "desc": "This exciting course broaches the hot topic of Data Analysis and Knowledge Discovery (DAKD) from the viewpoint of Data Mining."
  },
  {
    "titulacio": "MIRI",
    "sigles": "DEWS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/DEWS-MIRI",
    "nom": "Disseny i Avaluació de Sistemes Basats en la Web",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "ESSI",
    "desc": "This course aims to extend and integrate students' knowledge from earlier engineering subjects in the area of designing distributed and web-based applications with a hands-on approach that will cover the requirements, design, implementation and deployment of both the client and the server applications using cloud services and tools."
  },
  {
    "titulacio": "MIRI",
    "sigles": "DW",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/DW-MIRI",
    "nom": "Data Warehousing",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Ciència de les Dades)",
    "Departament": "ESSI",
    "desc": "L'assignatura introdueix els conceptes de bases de dades orientades a la intel·ligència empresarial. En concret, això inclou bases de dades multidimensionals i magatzems de dades (DW), així com els processos ETL (Extract, Transform, Load) i conceptes bàsics de quadres de comandaments. Seran introduïdes les tècniques necessàries per a dissenyar, implementar, explotar, i mantenir els magatzems de dades parant especial atenció a dades espai-temporals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "EA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/EA-MIRI",
    "nom": "Elements d'Animació",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": "We introduce the essential tools for the animation of different objects, ranging from simple point particles to articulated humanoids. Continuous physically-based animation is compared to discrete, mainly rule based, animation in order to obtain a wide picture of the present animation methods. Character animation techniques are studied ranging from one character to large crowds."
  },
  {
    "titulacio": "MIRI",
    "sigles": "EB",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/EB-MIRI",
    "nom": "E-Business",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Serveis)",
    "Departament": "OE",
    "desc": "Quan parlem d'e-Business ens referim a l'ús estratègic de les tecnologies de la comunicació i de la informació en una organització. La finalitat última de qualsevol companyia és el de proveir productes o serveis a usuaris i clients a través de diferents models de negoci que poden ser recolzats per tecnologiesd'e-Commerce. Però l'e-Business és un concepte més ampli que inclou activitats que cobreixen tots els processos de negoci, des dels interns fins als que estan relacionats amb el contacte amb el client, incorporant les relacions entre la companyia i els seus principals agents en la cadena de valor com ara proveïdors, distribuïdors, minoristes i clients."
  },
  {
    "titulacio": "MIRI",
    "sigles": "GP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/GP-MIRI",
    "nom": "Processament Geomètric",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": "This course explores some of the most important algorithms for processing polygonal meshes (mainly triangular meshes). The main topics covered will include the construction of meshes from real objects, the filtering of geometric and topological noise, the parametrization of meshes, their deformation and edition, and their compression."
  },
  {
    "titulacio": "MIRI",
    "sigles": "INM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/INM-MIRI",
    "nom": "Introducció al Modelatge de Xarxes",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "AC",
    "desc": "The course covers some basic modeling techniques used in networking research. In particular it discusses discrete and continuous probability models, linear systems and signal space. These concepts are introduced through classical examples taken from different research areas, including traffic modelling, wireless transmission systems, smartphone sensor data filtering, switching systems, address lookup algorithms, optical switching, anti-spam filters, etc."
  },
  {
    "titulacio": "MIRI",
    "sigles": "IR",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/IR-MIRI",
    "nom": "Recuperació de la Informació",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "CS",
    "desc": "La informació emmagatzemada digitalment en moltes organitzacions, o col·lectivament en la web, és avui dia prou gran perquè trobar allò que es busca sigui generalment complicat. El camp conegut com a \"Information Retrieval\" tracta dels mètodes per organitzar informació i permetre després als usuaris trobar-la de manera còmoda i eficient. Cobrirem les tècniques bàsiques de cerca de documentació textual basada en paraules clau. Examinarem després el cas de la cerca en la web, on la presència d'hiperenllaços pot usar-se no sols per dirigir la cerca sinó per valorar l'interès de cada pàgina - és el cas del conegut algorisme PageRank. Veurem l'extensió d'aquestes tècniques al cas de les xarxes socials on el graf d'interaccions entre usuaris proporciona molta informació de què pot interessar a cadascun. Finalment, estudiarem com les tecnologies de Big Data i de recomanació es complementen en sistemes de cerca d'informació actuals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "KMLMM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/KMLMM-MIRI",
    "nom": "Aprenentatge Automàtic Basat en Kernel i Modelat Multivariant",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "EIO;CS",
    "desc": "Kernel based Machine Learning and Multivariate Modeling"
  },
  {
    "titulacio": "MIRI",
    "sigles": "MGTN",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/MGTN-MIRI",
    "nom": "Mecanismes i Teoria de Jocs en Xarxes",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Xarxes de Computadors i Sistemes Distribuïts)",
    "Departament": "AC",
    "desc": "The goal of this course is giving the student a background in the methodologies in the advanced design of mechanisms using non-lineal convex optimization and game theory. The program will cover from basic concepts related to convexity, convex optimization problems, Game Theory, Nash Equilibria, to applications of these methodologies to networking such as resource allocation, back-pressure models, power-control models compressive sensing, game theory in wireless networks, pricing models in networks, game theory in routing problems or incentives in P2P systems."
  },
  {
    "titulacio": "MIRI",
    "sigles": "ML",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/ML-MIRI",
    "nom": "Aprenentatge Automàtic",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Ciència de les Dades)",
    "Departament": "CS",
    "desc": "The aim of machine learning is the development of theories, techniques and algorithms to allow a computer system to modify its behavior in a given environment through inductive inference. The goal is to infer practical solutions to difficult problems --for which a direct approach is not feasible-- based on observed data about a phenomenon or process. Machine learning is a meeting point of different disciplines: statistics, optimization and algorithmics, among others."
  },
  {
    "titulacio": "MIRI",
    "sigles": "MVA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/MVA-MIRI",
    "nom": "Anàlisi Multivariant",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Ciència de les Dades)",
    "Departament": "EIO",
    "desc": "L'objectiu del curs és proporcionar els conceptes estadístics de l'anàlisi de dades multivariants i les seves tècniques bàsiques, que constitueixen un dels pilars fonamentals de la Mineria de Dades."
  },
  {
    "titulacio": "MIRI",
    "sigles": "NCD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/NCD-MIRI",
    "nom": "Disseny de Circuits Nanoelectrònics",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Computació d'Altes Prestacions)",
    "Departament": "AC",
    "desc": "This course offers a technology perspective into digital system design in the context nanoelectronic VLSI systems.  The course includes a review CMOS logic circuits; impact of fabrication issues on the design of CMOS logic circuits; performance and power estimation; deep submicron design issues; ASIC design flow and low power design.  This course is technology driven so future technologies will also be presented, analyzed and benchmarked."
  },
  {
    "titulacio": "MIRI",
    "sigles": "OD",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/OD-MIRI",
    "nom": "Open Data",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Ciència de les Dades)",
    "Departament": "ESSI",
    "desc": "Big Data is traditionally defined with the three V's: Volume, Velocity and Variety. Traditionally, Big Data has been associated with Volume (e.g., the Hadoop ecosystem) and recently Velocity has earned its momentum (especially, with the arrival of Stream processors such as Spark). However,"
  },
  {
    "titulacio": "MIRI",
    "sigles": "OTDM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/OTDM-MIRI",
    "nom": "Tècniques d'Optimització per a la Mineria de Dades",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "EIO",
    "desc": "The course introduces the basic concepts of optimization and the different types of optimization problems, the iterative algorithms to solve these problems, and their properties. The practice of optimization using modeling languages to describe a problem and commercial and publicly available solvers is also emphasized."
  },
  {
    "titulacio": "MIRI",
    "sigles": "RES",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/RES-MIRI",
    "nom": "Enginyeria de Requisits pels Serveis",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "The term 'service' has been defined as \"a provider/client interaction that creates and captures value\". Value can be considered the quality that renders something desirable or worthwhile. Central to this definition is an understanding of the business context, the stakeholders involved in an exchange and their respective goals and needs. This is the major concern of  the course on Requirements Engineering for Services. It covers both requirements elicitation and requirements specification for services. Additionally, since IT is the main driver for innovation in Services, we focus on IT service-oriented requirements engineering."
  },
  {
    "titulacio": "MIRI",
    "sigles": "RRMM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/RRMM-MIRI",
    "nom": "Representació en Temps Real de Models Massius",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": "Aquest curs introduirà les diverses tècniques que permeten la visualització interactiva i la manipulació d'objectes i escenes molt complexos. Si bé hi ha hagut un salt en la potència del maquinari de gràfics, és possible generar conjunts de dades més complexos a través dels avenços en el modelatge 3D, simulació i captura de dades. Per tant, la necessitat de tractar aquests models massius sorgeix en camps com ara la visualització científica, CAD, el patrimoni cultural, motors de videojocs i altres. Els estudiants estaran exposats a una representació jeràrquica d'escenes, la simplificació de models i algorismes de visibilitat. Com a resultat, s'obtindrà una visió global del problema i un ampli coneixement de les solucions actuals."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SEAIT",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SEAIT-MIRI",
    "nom": "Aspectes Socials i Ambientals de Les Tecnologies de la Informació",
    "Crèdits": "3",
    "Tipus": "Complementària d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "In this course we debate the impact on society of new advances in Business Intelligence and Big Data. The course is structured in two parts. In the first one we focus on reading and debating on visionary papers that draw new research lines in the field of decisional systems (the so-called next Generation BI systems that are tightly related with Big Data). In the second part we focus on ethics and the impact of such approaches on society."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SIBIT",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SIBIT-MIRI",
    "nom": "Innovació en Els Serveis Basada en Les Tecnologies de la Informació",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "ESSI",
    "desc": "This course provides an in-depth analysis of a representative set of case studies of successful innovation in services based on new uses of information tecnologies. For each case study, the course analyses the factors that lead to its success, the problems found, and the lessons learnt. The course also classifies each case study in terms of a general framework.  At the end of the course, the student will be able to classify a particular service system in the framework, and apply (some of) the lessons learnt in the case studies to that system."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SM",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SM-MIRI",
    "nom": "Gestió de Serveis",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Serveis)",
    "Departament": "OE",
    "desc": "Cada vegada més, les economies de tot el món s'estan orientant més cap als serveis. Aquest fet implica que hi ha una necessitat d'anar un pas més enllà en l'estudi de tots els aspectes relacionats amb la gestió dels serveis sectorials. L'objectiu principal d'aquest curs és el de proporcionar als estudiants una imatge completa i comprensible de la gestió del sector de serveis, oferint-los una visió integrada d'aquest camp d'estudi emergent. Els continguts del curs inclouen: contextualització del sector serveis i el seu paper en l'economia, gestió estratègica de serveis, gestió de carteres de serveis, innovació i productivitat en el sector serveis, màrqueting de serveis, qualitat dels serveis i sistemes de serveis."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SNLP",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SNLP-MIRI",
    "nom": "Processament Estadístic del Llenguatge Natural",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Ciència de les Dades)",
    "Departament": "CS",
    "desc": "Aquest curs és una introducció a les tasques, aplicacions, tècniques i recursos més rellevants utilitzats en el processament del llenguatge natural  (PLN) basat en mètodes empírics, bàsicament estadístics i basats en aprenentatge anutomàtic."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SOA",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SOA-MIRI",
    "nom": "Arquitectura Orientada als Serveis",
    "Crèdits": "6",
    "Tipus": "Obligatòria d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "This course focuses on service-oriented architectural model and the service-orientation design paradigm. It will describe Service Oriented Architecture (SOA) concepts and principles, as well as quality considerations for developing modern software systems from a technical and organizational perspective."
  },
  {
    "titulacio": "MIRI",
    "sigles": "SOBI",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/SOBI-MIRI",
    "nom": "Bussiness Intelligence Orientada als Serveis",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "The main goal of this course is to analyze the technological and engineering needs of Big Data Management. The enabling technology for such a challenge is cloud services, which provide the elasticity needed to properly scale the infrastructure as the needs of the company grow. Thus, students will learn advanced data management techniques (i.e., NOSQL solutions) that also scale with the infrastructure. Being Big Data Management the evolution of Data Warehousing, such knowledge (see the corresponding subject in Data Science speciality for more details on its contents) is assumed in this course , which will specifically focus on the management of data Volume and Velocity."
  },
  {
    "titulacio": "MIRI",
    "sigles": "VV",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/VV-MIRI",
    "nom": "Visualització del Volum",
    "Crèdits": "6",
    "Tipus": "Optativa",
    "Departament": "CS",
    "desc": ""
  },
  {
    "titulacio": "MIRI",
    "sigles": "WS",
    "url_fib": "https://www.fib.upc.edu/ca/estudis/masters/master-en-innovacio-i-recerca-en-informatica/pla-destudis/assignatures/WS-MIRI",
    "nom": "Serveis Web",
    "Crèdits": "6",
    "Tipus": "Complementària d'especialitat (Enginyeria de Serveis)",
    "Departament": "ESSI",
    "desc": "This course focus on the need for systems interoperability and how Web services, an umbrella concept for different cross-platform solutions based on Web standards, attempt to overcome the many challenges that distributed information systems have addressed in various ways (but not always successfully) in the past. By the end of the course, students will have learned the relevant concepts related to the nature, characteristics and types of Web Services and acquired some experience in consuming, designing, constructing and maintaining services located at the web."
  }
]